[Killed] DecrementInteger
Controllers/Api/UserController.php:24:9
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
         // Parsning + hårda gränser (robust mot mutationer)
-        $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
+        $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 0;
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.80f9a6180e59bd7fd142958c66cd10e6.infection.xml

..{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"84"},"body":{"success":false,"errors":[{"field":"page","messages":"current_page must be >= 1"}]}}

[Killed] CastInt
Controllers/Api/UserController.php:24:9
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
         // Parsning + hårda gränser (robust mot mutationer)
-        $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
+        $currentPage = is_numeric($pageRaw) ? $pageRaw : 1;
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 
killedBy: Radix\Tests\Api\UserControllerTest::testGetPaginationDefaultsAndLogics
statusReason: 1) Radix\Tests\Api\UserControllerTest::testGetPaginationDefaultsAndLogics
TypeError: Radix\Database\QueryBuilder\QueryBuilder::paginate(): Argument #2 ($currentPage) must be of type int, string given, called in C:\Users\mats\PhpstormProjects\Radix\src\Controllers\Api\UserController.php on line 46

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\QueryBuilder\Concerns\Pagination.php:87
C

[Killed] LessThan
Controllers/Api/UserController.php:28:9
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 
         // Hårda valideringar för att neutralisera mutationer
-        if ($currentPage < 1) {
+        if ($currentPage <= 1) {
             $this->respondWithErrors(['page' => 'current_page must be >= 1'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.ba5095b8ff97f256d9788bcb9721efbe.infection.xml

{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"84"},"body":{"success":false,"errors":[{"field":"page","messages":"current_page must be >= 1"}]}}

[Killed] LessThanNegotiation
Controllers/Api/UserController.php:28:9
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 
         // Hårda valideringar för att neutralisera mutationer
-        if ($currentPage < 1) {
+        if ($currentPage >= 1) {
             $this->respondWithErrors(['page' => 'current_page must be >= 1'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.dc96253d47c598623d0d60ba24a41788.infection.xml

{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"84"},"body":{"success":false,"errors":[{"field":"page","messages":"current_page must be >= 1"}]}}

[Killed] LessThanNegotiation
Controllers/Api/UserController.php:32:9
             $this->respondWithErrors(['page' => 'current_page must be >= 1'], 422);
         }
 
-        if ($perPage < 1) {
+        if ($perPage >= 1) {
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.f9d37eda0c65a79eb4b60bf3c2e65834.infection.xml

{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"96"},"body":{"success":false,"errors":[{"field":"perPage","messages":"per_page must be between 1 and 100"}]}}

[Killed] LessThan
Controllers/Api/UserController.php:32:9
             $this->respondWithErrors(['page' => 'current_page must be >= 1'], 422);
         }
 
-        if ($perPage < 1) {
+        if ($perPage <= 1) {
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.010c31723799245cb37f0bd012ce6ce9.infection.xml

{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"96"},"body":{"success":false,"errors":[{"field":"perPage","messages":"per_page must be between 1 and 100"}]}}

[Killed] GreaterThanNegotiation
Controllers/Api/UserController.php:36:9
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
         // Dela upp övre gränsen för att stå emot >= / > mutationer
-        if ($perPage > 100) {
+        if ($perPage <= 100) {
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.6f7bd27503f94a6daad01b4bd53e4bcb.infection.xml

{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"96"},"body":{"success":false,"errors":[{"field":"perPage","messages":"per_page must be between 1 and 100"}]}}

[Killed] GreaterThan
Controllers/Api/UserController.php:36:9
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
         // Dela upp övre gränsen för att stå emot >= / > mutationer
-        if ($perPage > 100) {
+        if ($perPage >= 100) {
             $this->respondWithErrors(['perPage' => 'per_page must be between 1 and 100'], 422);
         }
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.912bbdfed78215512679e89da85fc3c2.infection.xml

.{"status":422,"headers":{"Content-Type":"application\/json","Content-Length":"96"},"body":{"success":false,"errors":[{"field":"perPage","messages":"per_page must be between 1 and 100"}]}}

[Killed] ArrayItem
Controllers/Api/UserController.php:86:13
 
         $status = new Status();
         $status->fill([
-            'user_id' => $user->id,
+            'user_id' > $user->id,
             'status' => 'activate',
         ]);
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
TypeError: Radix\Database\ORM\Model::isFillable(): Argument #1 ($key) must be of type string, int given, called in C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php on line 408

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:337
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.p

[Killed] LogicalAndSingleSubExprNegation
Controllers/Api/UserController.php:116:9
         $data = $this->request->filterFields($this->request->post, []);
 
         // Hantera lösenord
-        if (array_key_exists('password', $this->request->post)
-            && is_string($this->request->post['password'])
-            && $this->request->post['password'] !== ''
+        && !is_string($this->request->post['password'])
         ) {
             /** @var non-empty-string $password */
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Lösenordet matchar inte i databasen.
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:727

FAILURES!
Tests: 9, Assertions: 47, Failures: 1.

[Killed] LogicalAnd
Controllers/Api/UserController.php:116:9
         $data = $this->request->filterFields($this->request->post, []);
 
         // Hantera lösenord
-        if (array_key_exists('password', $this->request->post)
-            && is_string($this->request->post['password'])
+        if ((array_key_exists('password', $this->request->post) || is_string($this->request->post['password']))
             && $this->request->post['password'] !== ''
         ) {
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdateWithNullPassword
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdateWithNullPassword
TypeError: App\Models\User::setPasswordAttribute(): Argument #1 ($value) must be of type string, null given, called in C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php on line 500

C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:38
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\M

[Killed] LogicalNot
Controllers/Api/UserController.php:190:13
         if (!array_key_exists('deleted_at', $user->getAttributes())) {
             $rawDeletedAt = $user->fetchGuardedAttribute('deleted_at');
 
-            if (!is_string($rawDeletedAt)) {
+            if (is_string($rawDeletedAt)) {
                 $rawDeletedAt = null;
             }
killedBy: Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
Failed asserting that 200 matches expected 400.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1167

FAILURES!
Tests: 16, Assertions: 63, Failures: 1.

[Killed] LogicalNot
Controllers/Api/UserController.php:199:9
         }
 
         // Steg 4: Kontrollera om användaren redan är soft deleted
-        if (!empty($user->deleted_at)) {
+        if (empty($user->deleted_at)) {
             return $this->json([
                 'success' => false,
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Statuskoden ska vara 200 vid en framgångsrik DELETE
Failed asserting that 400 matches expected 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1105

FAILURES!
Tests: 15, Assertions: 59, Failures: 1.

[Killed] ReturnRemoval
Controllers/Api/UserController.php:200:13
 
         // Steg 4: Kontrollera om användaren redan är soft deleted
         if (!empty($user->deleted_at)) {
-            return $this->json([
-                'success' => false,
-                'errors' => ['user' => 'Användaren är redan soft deleted.'],
-            ], 400);
+            
         }
 
killedBy: Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
Failed asserting that 200 matches expected 400.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1167

FAILURES!
Tests: 16, Assertions: 63, Failures: 1.

[Killed] FalseValue
Controllers/Api/UserController.php:201:17
         // Steg 4: Kontrollera om användaren redan är soft deleted
         if (!empty($user->deleted_at)) {
             return $this->json([
-                'success' => false,
+                'success' => true,
                 'errors' => ['user' => 'Användaren är redan soft deleted.'],
             ], 400);
killedBy: Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
Failed asserting that true is false.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1170

FAILURES!
Tests: 16, Assertions: 64, Failures: 1.

[Killed] DecrementInteger
Controllers/Api/UserController.php:203:13
             return $this->json([
                 'success' => false,
                 'errors' => ['user' => 'Användaren är redan soft deleted.'],
-            ], 400);
+            ], 399);
         }
 
killedBy: Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
Failed asserting that 399 matches expected 400.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1167

FAILURES!
Tests: 16, Assertions: 63, Failures: 1.

[Killed] IncrementInteger
Controllers/Api/UserController.php:203:13
             return $this->json([
                 'success' => false,
                 'errors' => ['user' => 'Användaren är redan soft deleted.'],
-            ], 400);
+            ], 401);
         }
 
killedBy: Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDeleteAlreadyDeleted
Failed asserting that 401 matches expected 400.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:1167

FAILURES!
Tests: 16, Assertions: 63, Failures: 1.
