[Killed] Ternary
Middlewares/IpAllowlist.php:33:9
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
         // Använd ?: för att hantera både false och tom sträng som null.
         // Detta dödar LogicalAnd-mutanten på rad 31.
-        $trustedProxy = $trustedProxyEnv ?: null;
+        $trustedProxy = $trustedProxyEnv ? null : $trustedProxyEnv;
 
         // Förenkla villkoret genom att använda $clientIp istället för att kolla $_SERVER igen.
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] LogicalAnd
Middlewares/IpAllowlist.php:37:9
 
         // Förenkla villkoret genom att använda $clientIp istället för att kolla $_SERVER igen.
         // Detta tar bort redundans och dödar LogicalAnd-mutanten på rad 33.
-        if ($trustedProxy !== null && $clientIp === $trustedProxy) {
+        if ($trustedProxy !== null || $clientIp === $trustedProxy) {
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
killedBy: Radix\Tests\Api\IpAllowlistTest::testUntrustedProxyCannotSpoofIp
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testUntrustedProxyCannotSpoofIp
Endast den betrodda proxyn får ange X-Forwarded-For.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:319

FAILURES!
Tests: 16, Assertions: 19, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
Middlewares/IpAllowlist.php:37:9
 
         // Förenkla villkoret genom att använda $clientIp istället för att kolla $_SERVER igen.
         // Detta tar bort redundans och dödar LogicalAnd-mutanten på rad 33.
-        if ($trustedProxy !== null && $clientIp === $trustedProxy) {
+        if (!($trustedProxy !== null) && !($clientIp === $trustedProxy)) {
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] NotIdentical
Middlewares/IpAllowlist.php:38:13
         // Förenkla villkoret genom att använda $clientIp istället för att kolla $_SERVER igen.
         // Detta tar bort redundans och dödar LogicalAnd-mutanten på rad 33.
         if ($trustedProxy !== null && $clientIp === $trustedProxy) {
-            if ($forwardedFor !== '') {
+            if ($forwardedFor === '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
                 if (!empty($parts)) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] Ternary
Middlewares/IpAllowlist.php:56:9
         // Använd ?: för att hantera både false och tom sträng som 'production'.
         // Detta undviker CastString-mutanten och gör koden renare.
         $appEnvEnv = getenv('APP_ENV');
-        $env = $appEnvEnv ?: 'production';
+        $env = $appEnvEnv ? 'production' : $appEnvEnv;
 
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
killedBy: Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
I development ska middleware släppa igenom alla IP.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:261

FAILURES!
Tests: 13, Assertions: 16, Failures: 1.

[Killed] LogicalOr
Middlewares/IpAllowlist.php:61:9
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
 
         // Släpp igenom helt i local/development
-        if (in_array($env, ['local', 'development'], true) || $isLocal) {
+        if (in_array($env, ['local', 'development'], true) && $isLocal) {
             return $next->handle($request);
         }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
I development ska middleware släppa igenom alla IP.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:261

FAILURES!
Tests: 13, Assertions: 16, Failures: 1.

[Killed] LogicalOrNegation
Middlewares/IpAllowlist.php:61:9
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
 
         // Släpp igenom helt i local/development
-        if (in_array($env, ['local', 'development'], true) || $isLocal) {
+        if (!(in_array($env, ['local', 'development'], true) || $isLocal)) {
             return $next->handle($request);
         }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Middlewares/IpAllowlist.php:75:17
             if (str_contains($rule, '/')) {
                 // Ändra till att hämta alla delar och validera antalet för att undvika IncrementInteger på limit.
                 $parts = explode('/', $rule);
-                if (count($parts) !== 2) {
+                if (count($parts) !== 1) {
                     continue;
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndNegation
Middlewares/IpAllowlist.php:84:21
 
                 // IPv4-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
+                    !(filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4) && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)))
                 ) {
                     if ($mask < 0 || $mask > 32) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Middlewares/IpAllowlist.php:84:21
 
                 // IPv4-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
+                    && !filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4))
                 ) {
                     if ($mask < 0 || $mask > 32) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] GreaterThanNegotiation
Middlewares/IpAllowlist.php:87:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                 ) {
-                    if ($mask < 0 || $mask > 32) {
+                    if ($mask < 0 || $mask <= 32) {
                         continue;
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LessThanNegotiation
Middlewares/IpAllowlist.php:87:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                 ) {
-                    if ($mask < 0 || $mask > 32) {
+                    if ($mask >= 0 || $mask > 32) {
                         continue;
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] DecrementInteger
Middlewares/IpAllowlist.php:98:21
                     // filter_var har redan garanterat att dessa är giltiga IPv4-adresser.
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
-                    $maskLong = -1 << (32 - $mask);
+                    $maskLong = -1 << (31 - $mask);
                     $maskLong = $maskLong & 0xFFFFFFFF;
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
ArithmeticError: Bit shift by negative number

C:\Users\mats\PhpstormProjects\Radix\src\Middlewares\IpAllowlist.php:98
C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:63
C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:212

ERRORS!

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:98:21
                     // filter_var har redan garanterat att dessa är giltiga IPv4-adresser.
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
-                    $maskLong = -1 << (32 - $mask);
+                    $maskLong = -1 << (33 - $mask);
                     $maskLong = $maskLong & 0xFFFFFFFF;
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
IP som skiljer sig på sista biten ska blockeras vid /32 mask.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:220

FAILURES!
Tests: 10, Assertions: 13, Failures: 1.

[Killed] Identical
Middlewares/IpAllowlist.php:103:21
 
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
                     // Detta dödar CastInt mutanten genom att ta bort den onödiga koden.
-                    if (($ipLong & $maskLong) === ($subnetLong & $maskLong)) {
+                    if ($ipLong & $maskLong !== $subnetLong & $maskLong) {
                         return $next->handle($request);
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Middlewares/IpAllowlist.php:110:21
 
                 // IPv6-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
+                    && !filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6))
                 ) {
                     if ($mask < 0 || $mask > 128) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] GreaterThanNegotiation
Middlewares/IpAllowlist.php:113:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                 ) {
-                    if ($mask < 0 || $mask > 128) {
+                    if ($mask < 0 || $mask <= 128) {
                         continue;
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Middlewares/IpAllowlist.php:125:9
 
         // Om vi kommer hit har ingen regel matchat -> Forbidden
         $res = new Response();
-        $res->setStatusCode(403);
+        
         $res->setHeader('Content-Type', 'text/plain; charset=utf-8');
         $res->setBody('Forbidden');
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
