[Killed] PublicVisibility
Controllers/Api/HealthController.php:14:5
 {
     public function __construct(private readonly \App\Services\HealthCheckService $health) {}
 
-    public function index(): JsonResponse
+    protected function index(): JsonResponse
     {
         $env = getenv('APP_ENV') ?: 'production';
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Error: Call to protected method App\Controllers\Api\HealthController::index() from scope Radix\Http\RequestHandler

C:\Users\mats\PhpstormProjects\Radix\framework\src\Http\RequestHandler.php:38
C:\Users\mats\PhpstormProjects\Radix\framework\src\Middleware\MiddlewareRequestHandler.php:27
C:\Users\mats\PhpstormProjects\Radix\

[Killed] Ternary
Controllers/Api/HealthController.php:16:9
 
     public function index(): JsonResponse
     {
-        $env = getenv('APP_ENV') ?: 'production';
+        $env = getenv('APP_ENV') ? 'production' : getenv('APP_ENV');
 
         $requireTokenEnv = getenv('HEALTH_REQUIRE_TOKEN');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'php'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:227

FAILURES!
Tests: 1, Assertions: 19, Failures: 1.

[Killed] MatchArmRemoval
Controllers/Api/HealthController.php:19:9
         $env = getenv('APP_ENV') ?: 'production';
 
         $requireTokenEnv = getenv('HEALTH_REQUIRE_TOKEN');
-        $requireToken = match ($requireTokenEnv) {
-            '1', 'true', 'on' => true,
-            '0', 'false', 'off' => false,
-            default => !in_array($env, ['local', 'development'], true),
-        };
+        '1', 'on' => true,
 
         if ($requireToken) {
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
Expectation failed for method name is "execute" when invoked at least once.
Expected invocation at least once but it never occurred.

FAILURES!
Tests: 10, Assertions: 36, Failures: 1.

[Killed] MatchArmRemoval
Controllers/Api/HealthController.php:19:9
         $env = getenv('APP_ENV') ?: 'production';
 
         $requireTokenEnv = getenv('HEALTH_REQUIRE_TOKEN');
-        $requireToken = match ($requireTokenEnv) {
-            '1', 'true', 'on' => true,
-            '0', 'false', 'off' => false,
-            default => !in_array($env, ['local', 'development'], true),
-        };
+        '0', 'false' => false,
 
         if ($requireToken) {
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.a2d5c3fefc82ad3fdace9b4b4bc4aaa2.infection.xml

{"status":401,"headers":{"Content-Type":"application\/json","Content-Length":"101"},"body":{"success":false,"errors":[{"field":"API-token","messages":["Token saknas eller är ogiltig."]}]}}

[Killed] TrueValue
Controllers/Api/HealthController.php:20:13
 
         $requireTokenEnv = getenv('HEALTH_REQUIRE_TOKEN');
         $requireToken = match ($requireTokenEnv) {
-            '1', 'true', 'on' => true,
+            '1', 'true', 'on' => false,
             '0', 'false', 'off' => false,
             default => !in_array($env, ['local', 'development'], true),
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
Expectation failed for method name is "execute" when invoked at least once.
Expected invocation at least once but it never occurred.

FAILURES!
Tests: 10, Assertions: 36, Failures: 1.

[Killed] FalseValue
Controllers/Api/HealthController.php:21:13
         $requireTokenEnv = getenv('HEALTH_REQUIRE_TOKEN');
         $requireToken = match ($requireTokenEnv) {
             '1', 'true', 'on' => true,
-            '0', 'false', 'off' => false,
+            '0', 'false', 'off' => true,
             default => !in_array($env, ['local', 'development'], true),
         };
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.f4d3a1c0ecfee14135d50640f8143759.infection.xml

{"status":401,"headers":{"Content-Type":"application\/json","Content-Length":"101"},"body":{"success":false,"errors":[{"field":"API-token","messages":["Token saknas eller är ogiltig."]}]}}

[Killed] LogicalNot
Controllers/Api/HealthController.php:22:13
         $requireToken = match ($requireTokenEnv) {
             '1', 'true', 'on' => true,
             '0', 'false', 'off' => false,
-            default => !in_array($env, ['local', 'development'], true),
+            default => in_array($env, ['local', 'development'], true),
         };
 
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.46aafa9a321f3a7f7b509a27ed646b3a.infection.xml

......{"status":401,"headers":{"Content-Type":"application\/json","Content-Length":"101"},"body":{"success":false,"errors":[{"field":"API-token","messages":["Token saknas eller är ogiltig."]}

[Killed] IfNegation
Controllers/Api/HealthController.php:25:9
             default => !in_array($env, ['local', 'development'], true),
         };
 
-        if ($requireToken) {
-            $this->validateRequest();
-        }
+        if (!$requireToken) {
 
         $start = microtime(true);
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.05167e5f9bd2dfee96ba954f178b2a30.infection.xml

{"status":401,"headers":{"Content-Type":"application\/json","Content-Length":"101"},"body":{"success":false,"errors":[{"field":"API-token","messages":["Token saknas eller är ogiltig."]}]}}

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:26:13
         };
 
         if ($requireToken) {
-            $this->validateRequest();
+            
         }
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsTrueString
Expectation failed for method name is "execute" when invoked at least once.
Expected invocation at least once but it never occurred.

FAILURES!
Tests: 10, Assertions: 36, Failures: 1.

[Killed] Coalesce
Controllers/Api/HealthController.php:33:9
 
         $checks = $this->health->run();
         /** @var bool $ok */
-        $ok = ($checks['_ok'] ?? false);
+        $ok = (false ?? $checks['_ok']);
         unset($checks['_ok']);
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Controllers/Api/HealthController.php:33:9
 
         $checks = $this->health->run();
         /** @var bool $ok */
-        $ok = ($checks['_ok'] ?? false);
+        $ok = ($checks['_ok'] ?? true);
         unset($checks['_ok']);
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturns500WhenOkKeyIsMissing
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturns500WhenOkKeyIsMissing
Failed asserting that 200 is identical to 500.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:342

FAILURES!
Tests: 4, Assertions: 27, Failures: 1.

[Killed] Identical
Controllers/Api/HealthController.php:36:9
         $ok = ($checks['_ok'] ?? false);
         unset($checks['_ok']);
 
-        if ($env === 'production') {
+        if ($env !== 'production') {
             $checks = [
                 'db' => isset($checks['db']) ? ($checks['db'] === 'ok' ? 'ok' : 'fail') : 'unknown',
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'php'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:227

FAILURES!
Tests: 1, Assertions: 19, Failures: 1.

[Killed] Ternary
Controllers/Api/HealthController.php:44:9
         }
 
         $res = new JsonResponse();
-        $res->setStatusCode($ok ? 200 : 500);
+        $res->setStatusCode($ok ? 500 : 200);
         $res->setHeader('Content-Type', 'application/json; charset=utf-8');
         $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:44:9
         }
 
         $res = new JsonResponse();
-        $res->setStatusCode($ok ? 200 : 500);
+        
         $res->setHeader('Content-Type', 'application/json; charset=utf-8');
         $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturns500WhenChecksFail
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturns500WhenChecksFail
Failed asserting that 200 is identical to 500.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:302

FAILURES!
Tests: 3, Assertions: 24, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:45:9
 
         $res = new JsonResponse();
         $res->setStatusCode($ok ? 200 : 500);
-        $res->setHeader('Content-Type', 'application/json; charset=utf-8');
+        
         $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
         $res->setHeader('Pragma', 'no-cache');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'Content-Type'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:184

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:46:9
         $res = new JsonResponse();
         $res->setStatusCode($ok ? 200 : 500);
         $res->setHeader('Content-Type', 'application/json; charset=utf-8');
-        $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
+        
         $res->setHeader('Pragma', 'no-cache');
         $res->setHeader('Expires', '0');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'Cache-Control'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:209

FAILURES!
Tests: 1, Assertions: 11, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:47:9
         $res->setStatusCode($ok ? 200 : 500);
         $res->setHeader('Content-Type', 'application/json; charset=utf-8');
         $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
-        $res->setHeader('Pragma', 'no-cache');
+        
         $res->setHeader('Expires', '0');
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'Pragma'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:212

FAILURES!
Tests: 1, Assertions: 13, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:48:9
         $res->setHeader('Content-Type', 'application/json; charset=utf-8');
         $res->setHeader('Cache-Control', 'no-store, must-revalidate, max-age=0');
         $res->setHeader('Pragma', 'no-cache');
-        $res->setHeader('Expires', '0');
+        
 
         // Låt CorsListener styra CORS (dev på, prod av via CORS_ENABLED)
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'Expires'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:215

FAILURES!
Tests: 1, Assertions: 15, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/Api/HealthController.php:52:13
 
         // Låt CorsListener styra CORS (dev på, prod av via CORS_ENABLED)
         $body = json_encode(
-            ['ok' => $ok, 'checks' => $checks],
+            ['checks' => $checks],
             JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES | JSON_THROW_ON_ERROR
         );
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that null is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:226

--

1 test triggered 1 PHP warning:

[Killed] MethodCallRemoval
Controllers/Api/HealthController.php:57:9
         );
 
         // Låt CorsListener styra CORS (dev på, prod av via CORS_ENABLED)
-        $res->setBody($body);
+        
 
         return $res;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that null is of type array.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:224

FAILURES!
Tests: 1, Assertions: 17, Failures: 1.
