[Killed] PublicVisibility
Controllers/Api/UserController.php:15:5
 
 class UserController extends ApiController
 {
-    public function index(): JsonResponse
+    protected function index(): JsonResponse
     {
         $this->validateRequest(); // Kontrollera API-token för GET-anrop
killedBy: Radix\Tests\Api\UserControllerTest::testGet
statusReason: 1) Radix\Tests\Api\UserControllerTest::testGet
Error: Call to protected method App\Controllers\Api\UserController::index() from scope Radix\Tests\Api\UserControllerTest

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:183

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] MethodCallRemoval
Controllers/Api/UserController.php:17:9
 {
     public function index(): JsonResponse
     {
-        $this->validateRequest(); // Kontrollera API-token för GET-anrop
+        // Kontrollera API-token för GET-anrop // Kontrollera API-token för GET-anrop
 
         // Hämta användardata

[Survived] Coalesce
Controllers/Api/UserController.php:20:9
         $this->validateRequest(); // Kontrollera API-token för GET-anrop
 
         // Hämta användardata
-        $pageRaw   = $this->request->get['page']    ?? 1;
+        $pageRaw   = 1 ?? $this->request->get['page'];
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 

[Survived] DecrementInteger
Controllers/Api/UserController.php:20:9
         $this->validateRequest(); // Kontrollera API-token för GET-anrop
 
         // Hämta användardata
-        $pageRaw   = $this->request->get['page']    ?? 1;
+        $pageRaw   = $this->request->get['page']    ?? 0;
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 

[Survived] IncrementInteger
Controllers/Api/UserController.php:21:9
 
         // Hämta användardata
         $pageRaw   = $this->request->get['page']    ?? 1;
-        $perPageRaw = $this->request->get['perPage'] ?? 10;
+        $perPageRaw = $this->request->get['perPage'] ?? 11;
 
         $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;

[Survived] DecrementInteger
Controllers/Api/UserController.php:21:9
 
         // Hämta användardata
         $pageRaw   = $this->request->get['page']    ?? 1;
-        $perPageRaw = $this->request->get['perPage'] ?? 10;
+        $perPageRaw = $this->request->get['perPage'] ?? 9;
 
         $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;

[Survived] Ternary
Controllers/Api/UserController.php:23:9
         $pageRaw   = $this->request->get['page']    ?? 1;
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
-        $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
+        $currentPage = is_numeric($pageRaw) ? 1 : (int) $pageRaw;
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 

[Survived] CastInt
Controllers/Api/UserController.php:23:9
         $pageRaw   = $this->request->get['page']    ?? 1;
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
-        $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
+        $currentPage = is_numeric($pageRaw) ? $pageRaw : 1;
         $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
 

[Survived] CastInt
Controllers/Api/UserController.php:24:9
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
         $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
-        $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
+        $perPage     = is_numeric($perPageRaw) ? $perPageRaw : 10;
 
         /** @var array{

[Survived] DecrementInteger
Controllers/Api/UserController.php:24:9
         $perPageRaw = $this->request->get['perPage'] ?? 10;
 
         $currentPage = is_numeric($pageRaw) ? (int) $pageRaw : 1;
-        $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 10;
+        $perPage     = is_numeric($perPageRaw) ? (int) $perPageRaw : 9;
 
         /** @var array{

[Killed] TrueValue
Controllers/Api/UserController.php:35:13
             ->paginate($perPage, $currentPage);
 
         return $this->json([
-            'success' => true,
+            'success' => false,
             'data' => array_map(
                 /**
killedBy: Radix\Tests\Api\UserControllerTest::testGet
statusReason: 1) Radix\Tests\Api\UserControllerTest::testGet
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:198

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Controllers/Api/UserController.php:48:5
         ]);
     }
 
-    public function store(): JsonResponse
+    protected function store(): JsonResponse
     {
         // Validera inkommande förfrågan
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Error: Call to protected method App\Controllers\Api\UserController::store() from scope Radix\Tests\Api\UserControllerTest

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:263

ERRORS!
Tests: 2, Assertions: 7, Errors: 1.

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:51:9
     public function store(): JsonResponse
     {
         // Validera inkommande förfrågan
-        $this->validateRequest([
-            'first_name' => 'required|string|min:2|max:15',
-            'last_name' => 'required|string|min:2|max:15',
-            'email' => 'required|email|unique:App\Models\User,email',
-            'password' => 'required|string|min:8|max:15',
-            'password_confirmation' => 'required|confirmed:password',
-        ]);
+        
 
         $data = $this->request->post;
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'John'
+''

[Killed] Ternary
Controllers/Api/UserController.php:61:9
 
         $data = $this->request->post;
 
-        $firstName = is_string($data['first_name'] ?? null) ? $data['first_name'] : '';
+        $firstName = is_string($data['first_name'] ?? null) ? '' : $data['first_name'];
         $lastName  = is_string($data['last_name'] ?? null) ? $data['last_name'] : '';
         $email     = is_string($data['email'] ?? null) ? $data['email'] : '';
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'John'
+''

[Survived] Ternary
Controllers/Api/UserController.php:62:9
         $data = $this->request->post;
 
         $firstName = is_string($data['first_name'] ?? null) ? $data['first_name'] : '';
-        $lastName  = is_string($data['last_name'] ?? null) ? $data['last_name'] : '';
+        $lastName  = is_string($data['last_name'] ?? null) ? '' : $data['last_name'];
         $email     = is_string($data['email'] ?? null) ? $data['email'] : '';
         /** @var non-empty-string $password */

[Killed] Ternary
Controllers/Api/UserController.php:63:9
 
         $firstName = is_string($data['first_name'] ?? null) ? $data['first_name'] : '';
         $lastName  = is_string($data['last_name'] ?? null) ? $data['last_name'] : '';
-        $email     = is_string($data['email'] ?? null) ? $data['email'] : '';
+        $email     = is_string($data['email'] ?? null) ? '' : $data['email'];
         /** @var non-empty-string $password */
         $password  = is_string($data['password'] ?? null) ? $data['password'] : '';
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Failed asserting that null is not null.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:277

FAILURES!
Tests: 2, Assertions: 11, Failures: 1.

[Survived] Ternary
Controllers/Api/UserController.php:65:9
         $lastName  = is_string($data['last_name'] ?? null) ? $data['last_name'] : '';
         $email     = is_string($data['email'] ?? null) ? $data['email'] : '';
         /** @var non-empty-string $password */
-        $password  = is_string($data['password'] ?? null) ? $data['password'] : '';
+        $password  = is_string($data['password'] ?? null) ? '' : $data['password'];
 
         // Skapa användare

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:69:9
 
         // Skapa användare
         $user = new User();
-        $user->fill([
-            'first_name' => $firstName,
-            'last_name'  => $lastName,
-            'email'      => $email,
-        ]);
+        
         $user->password = $password; // triggar setPasswordAttribute
         $user->save();
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
PDOException: SQLSTATE[23000]: Integrity constraint violation: 19 NOT NULL constraint failed: users.first_name

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\Connection.php:45
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:596
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:561
C:\Us

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:75:9
             'email'      => $email,
         ]);
         $user->password = $password; // triggar setPasswordAttribute
-        $user->save();
+        $user->password = $password;
 
         $status = new Status();
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Exception: Undefined property or relation 'id' in model.

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:490
C:\Users\mats\PhpstormProjects\Radix\src\Controllers\Api\UserController.php:78
C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:263

ERRORS!

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:78:9
         $user->save();
 
         $status = new Status();
-        $status->fill([
-            'user_id' => $user->id,
-            'status' => 'activate',
-        ]);
+        
         $status->save();
 
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
PDOException: SQLSTATE[23000]: Integrity constraint violation: 19 NOT NULL constraint failed: status.user_id

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\Connection.php:45
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:596
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:561
C:\User

[Survived] MethodCallRemoval
Controllers/Api/UserController.php:82:9
             'user_id' => $user->id,
             'status' => 'activate',
         ]);
-        $status->save();
+        
 
         // Returnera resultat

[Killed] TrueValue
Controllers/Api/UserController.php:85:9
         $status->save();
 
         // Returnera resultat
-        return $this->json(['success' => true, 'data' => $user->toArray()], 201);
+        return $this->json(['success' => false, 'data' => $user->toArray()], 201);
     }
 
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:270

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] DecrementInteger
Controllers/Api/UserController.php:85:9
         $status->save();
 
         // Returnera resultat
-        return $this->json(['success' => true, 'data' => $user->toArray()], 201);
+        return $this->json(['success' => true, 'data' => $user->toArray()], 200);
     }
 
killedBy: Radix\Tests\Api\UserControllerTest::testStore
statusReason: 1) Radix\Tests\Api\UserControllerTest::testStore
Failed asserting that 200 matches expected 201.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:266

FAILURES!
Tests: 2, Assertions: 8, Failures: 1.

[Killed] PublicVisibility
Controllers/Api/UserController.php:88:5
         return $this->json(['success' => true, 'data' => $user->toArray()], 201);
     }
 
-    public function update(string $id): JsonResponse
+    protected function update(string $id): JsonResponse
     {
         $this->validateRequest([
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Error: Call to protected method App\Controllers\Api\UserController::update() from scope Radix\Tests\Api\UserControllerTest

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:416

ERRORS!
Tests: 4, Assertions: 18, Errors: 1.

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:90:9
 
     public function update(string $id): JsonResponse
     {
-        $this->validateRequest([
-            'first_name' => 'nullable|string|min:2|max:15',
-            'last_name' => 'nullable|string|min:2|max:15',
-            'email' => 'nullable|email', // Endast validera om e-post skickas
-            'password' => 'nullable|string|min:6',
-        ]);
+        
 
         $user = User::find($id);
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Felaktigt förnamn
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Putupdated'
+'Put'

[Killed] LogicalNot
Controllers/Api/UserController.php:99:9
 
         $user = User::find($id);
 
-        if (!$user) {
+        if ($user) {
             return $this->json([
                 'success' => false,
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Statuskoden ska vara 200.
Failed asserting that 404 matches expected 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:419

FAILURES!
Tests: 4, Assertions: 19, Failures: 1.

[Survived] ArrayItemRemoval
Controllers/Api/UserController.php:106:9
             ], 404);
         }
 
-        $data = $this->request->filterFields($this->request->post, ['password']);
+        $data = $this->request->filterFields($this->request->post, []);
 
         // Hantera lösenord

[Survived] LogicalAndNegation
Controllers/Api/UserController.php:109:9
         $data = $this->request->filterFields($this->request->post, ['password']);
 
         // Hantera lösenord
-        if (array_key_exists('password', $this->request->post)
-            && is_string($this->request->post['password'])
-            && $this->request->post['password'] !== ''
+        if (!(array_key_exists('password', $this->request->post)
+            && is_string($this->request->post['password']) && $this->request->post['password'] !== '')
         ) {
             /** @var non-empty-string $password */

[Survived] LogicalAndSingleSubExprNegation
Controllers/Api/UserController.php:109:9
         $data = $this->request->filterFields($this->request->post, ['password']);
 
         // Hantera lösenord
-        if (array_key_exists('password', $this->request->post)
-            && is_string($this->request->post['password'])
-            && $this->request->post['password'] !== ''
+        if (!array_key_exists('password', $this->request->post)
         ) {
             /** @var non-empty-string $password */

[Survived] NotIdentical
Controllers/Api/UserController.php:111:13
         // Hantera lösenord
         if (array_key_exists('password', $this->request->post)
             && is_string($this->request->post['password'])
-            && $this->request->post['password'] !== ''
+            && $this->request->post['password'] === ''
         ) {
             /** @var non-empty-string $password */

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:118:9
             $user->password = $password;
         }
 
-        $user->fill($data);
+        
         $user->save();
 
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Felaktigt förnamn
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Putupdated'
+'Put'

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:119:9
         }
 
         $user->fill($data);
-        $user->save();
+        
 
         return $this->json([
killedBy: Radix\Tests\Api\UserControllerTest::testPutUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPutUpdate
Databasens förnamn matchar inte.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Putupdated'
+'Put'

[Killed] PublicVisibility
Controllers/Api/UserController.php:127:5
         ]);
     }
 
-    public function partialUpdate(string $id): JsonResponse
+    protected function partialUpdate(string $id): JsonResponse
     {
         $rules = [
killedBy: Radix\Tests\Api\UserControllerTest::testPatchUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPatchUpdate
Error: Call to protected method App\Controllers\Api\UserController::partialUpdate() from scope Radix\Tests\Api\UserControllerTest

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:336

ERRORS!
Tests: 3, Assertions: 12, Errors: 1.

[Survived] ArrayItemRemoval
Controllers/Api/UserController.php:129:9
 
     public function partialUpdate(string $id): JsonResponse
     {
-        $rules = [
-            'first_name' => 'sometimes|string|min:2|max:15',
-            'last_name' => 'sometimes|string|min:2|max:15',
-        ];
+        
 
         // Lägg endast till email-regeln om fältet existerar i indata

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:139:9
             $rules['email'] = "email|unique:App\Models\User,email,$id,id";
         }
 
-        $this->validateRequest($rules);
+        
 
         $user = User::find($id);
killedBy: Radix\Tests\Api\UserControllerTest::testPatchUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPatchUpdate
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Updatedname'
+'Patch'

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:154:9
         $data = $this->request->filterFields($this->request->post);
 
         // Uppdatera användaren
-        $user->fill($data);
+        
         $user->save();
 
killedBy: Radix\Tests\Api\UserControllerTest::testPatchUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPatchUpdate
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Updatedname'
+'Patch'

[Killed] ArrayItemRemoval
Controllers/Api/UserController.php:157:9
         $user->fill($data);
         $user->save();
 
-        return $this->json([
-            'success' => true,
-            'data' => $user->toArray(),
-        ]);
+        
     }
 
killedBy: Radix\Tests\Api\UserControllerTest::testPatchUpdate
statusReason: 1) Radix\Tests\Api\UserControllerTest::testPatchUpdate
Failed asserting that null is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:343

--

1 test triggered 1 PHP warning:

[Killed] PublicVisibility
Controllers/Api/UserController.php:163:5
         ]);
     }
 
-    public function delete(string $id): JsonResponse
+    protected function delete(string $id): JsonResponse
     {
         // Steg 1: Validera API-token eller session
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Error: Call to protected method App\Controllers\Api\UserController::delete() from scope Radix\Tests\Api\UserControllerTest

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:500

ERRORS!
Tests: 5, Assertions: 27, Errors: 1.

[Survived] MethodCallRemoval
Controllers/Api/UserController.php:166:9
     public function delete(string $id): JsonResponse
     {
         // Steg 1: Validera API-token eller session
-        $this->validateRequest();
+        
 
         // Steg 2: Hämta användaren (inklusive trashed)

[Survived] TrueValue
Controllers/Api/UserController.php:169:9
         $this->validateRequest();
 
         // Steg 2: Hämta användaren (inklusive trashed)
-        $user = User::find($id, true);
+        $user = User::find($id, false);
 
         // Kontrollera att användaren existerar

[Killed] LogicalNot
Controllers/Api/UserController.php:172:9
         $user = User::find($id, true);
 
         // Kontrollera att användaren existerar
-        if (!$user) {
+        if ($user) {
             return $this->json([
                 'success' => false,
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Statuskoden ska vara 200 vid en framgångsrik DELETE
Failed asserting that 404 matches expected 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:503

FAILURES!
Tests: 5, Assertions: 28, Failures: 1.

[Killed] LogicalNot
Controllers/Api/UserController.php:180:9
         }
 
         // Steg 3: Säkerställ att `deleted_at` finns, annars hämta det typ-säkert
-        if (!array_key_exists('deleted_at', $user->getAttributes())) {
+        if (array_key_exists('deleted_at', $user->getAttributes())) {
             $rawDeletedAt = $user->fetchGuardedAttribute('deleted_at');
 
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Exception: Undefined property or relation 'deleted_at' in model.

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\ORM\Model.php:490
C:\Users\mats\PhpstormProjects\Radix\src\Controllers\Api\UserController.php:192
C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:500

ERRORS!

[Survived] LogicalAndAllSubExprNegation
Controllers/Api/UserController.php:183:13
         if (!array_key_exists('deleted_at', $user->getAttributes())) {
             $rawDeletedAt = $user->fetchGuardedAttribute('deleted_at');
 
-            if (!is_string($rawDeletedAt) && $rawDeletedAt !== null) {
+            if (is_string($rawDeletedAt) && !($rawDeletedAt !== null)) {
                 $rawDeletedAt = null;
             }

[Survived] LogicalAnd
Controllers/Api/UserController.php:183:13
         if (!array_key_exists('deleted_at', $user->getAttributes())) {
             $rawDeletedAt = $user->fetchGuardedAttribute('deleted_at');
 
-            if (!is_string($rawDeletedAt) && $rawDeletedAt !== null) {
+            if (!is_string($rawDeletedAt) || $rawDeletedAt !== null) {
                 $rawDeletedAt = null;
             }

[Killed] LogicalAnd
Controllers/Api/UserController.php:192:9
         }
 
         // Steg 4: Kontrollera om användaren redan är soft deleted
-        if ($user->deleted_at !== null && $user->deleted_at !== '') {
+        if ($user->deleted_at !== null || $user->deleted_at !== '') {
             return $this->json([
                 'success' => false,
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Statuskoden ska vara 200 vid en framgångsrik DELETE
Failed asserting that 400 matches expected 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:503

FAILURES!
Tests: 5, Assertions: 28, Failures: 1.

[Killed] NotIdentical
Controllers/Api/UserController.php:192:9
         }
 
         // Steg 4: Kontrollera om användaren redan är soft deleted
-        if ($user->deleted_at !== null && $user->deleted_at !== '') {
+        if ($user->deleted_at === null && $user->deleted_at !== '') {
             return $this->json([
                 'success' => false,
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
Statuskoden ska vara 200 vid en framgångsrik DELETE
Failed asserting that 400 matches expected 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:503

FAILURES!
Tests: 5, Assertions: 28, Failures: 1.

[Killed] MethodCallRemoval
Controllers/Api/UserController.php:201:13
 
         // Steg 5: Utför soft delete
         try {
-            $user->delete();
+            
         } catch (Throwable $e) {
             return $this->json([
killedBy: Radix\Tests\Api\UserControllerTest::testDelete
statusReason: 1) Radix\Tests\Api\UserControllerTest::testDelete
deleted_at ska vara satt för soft deleted användare.
Failed asserting that null is not null.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\UserControllerTest.php:515

FAILURES!
Tests: 5, Assertions: 31, Failures: 1.
