[Killed] IfNegation
Middlewares/IpAllowlist.php:22:13
         $clientIp = '';
         if (isset($_SERVER['REMOTE_ADDR'])) {
             $remoteAddr = $_SERVER['REMOTE_ADDR'];
-            if (is_string($remoteAddr)) {
-                $clientIp = $remoteAddr;
-            }
+            if (!is_string($remoteAddr)) {
         }
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
Exakt IP i allowlist ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:76

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Ternary
Middlewares/IpAllowlist.php:28:9
         }
 
         $forwardedRaw = $_SERVER['HTTP_X_FORWARDED_FOR'] ?? null;
-        $forwardedFor = is_string($forwardedRaw) ? $forwardedRaw : '';
+        $forwardedFor = is_string($forwardedRaw) ? '' : $forwardedRaw;
 
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] NotIdentical
Middlewares/IpAllowlist.php:31:9
         $forwardedFor = is_string($forwardedRaw) ? $forwardedRaw : '';
 
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
-        $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? $trustedProxyEnv : null;
+        $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv === '' ? $trustedProxyEnv : null;
 
         if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] Ternary
Middlewares/IpAllowlist.php:31:9
         $forwardedFor = is_string($forwardedRaw) ? $forwardedRaw : '';
 
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
-        $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? $trustedProxyEnv : null;
+        $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? null : $trustedProxyEnv;
 
         if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
Middlewares/IpAllowlist.php:33:9
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
         $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? $trustedProxyEnv : null;
 
-        if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
+        if (!($trustedProxy !== null) && !isset($_SERVER['REMOTE_ADDR']) && !($_SERVER['REMOTE_ADDR'] === $trustedProxy)) {
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] LogicalAnd
Middlewares/IpAllowlist.php:33:9
         $trustedProxyEnv = getenv('TRUSTED_PROXY');
         $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? $trustedProxyEnv : null;
 
-        if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
+        if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) || $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
killedBy: Radix\Tests\Api\IpAllowlistTest::testUntrustedProxyCannotSpoofIp
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testUntrustedProxyCannotSpoofIp
Endast den betrodda proxyn får ange X-Forwarded-For.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:319

FAILURES!
Tests: 16, Assertions: 19, Failures: 1.

[Killed] NotIdentical
Middlewares/IpAllowlist.php:34:13
         $trustedProxy = is_string($trustedProxyEnv) && $trustedProxyEnv !== '' ? $trustedProxyEnv : null;
 
         if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
-            if ($forwardedFor !== '') {
+            if ($forwardedFor === '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
                 if (!empty($parts)) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] UnwrapArrayMap
Middlewares/IpAllowlist.php:35:17
 
         if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
             if ($forwardedFor !== '') {
-                $parts = array_map('trim', explode(',', $forwardedFor));
+                $parts = explode(',', $forwardedFor);
                 if (!empty($parts)) {
                     $clientIp = $parts[0];
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] LogicalNot
Middlewares/IpAllowlist.php:36:17
         if ($trustedProxy !== null && isset($_SERVER['REMOTE_ADDR']) && $_SERVER['REMOTE_ADDR'] === $trustedProxy) {
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
-                if (!empty($parts)) {
+                if (empty($parts)) {
                     $clientIp = $parts[0];
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:37:21
             if ($forwardedFor !== '') {
                 $parts = array_map('trim', explode(',', $forwardedFor));
                 if (!empty($parts)) {
-                    $clientIp = $parts[0];
+                    $clientIp = $parts[1];
                 }
             }
killedBy: Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testTrustedProxyUsesXForwardedFor
När proxy är betrodd ska första X-Forwarded-For-IP matchas mot allowlist.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:279

FAILURES!
Tests: 14, Assertions: 17, Failures: 1.

[Killed] Ternary
Middlewares/IpAllowlist.php:43:9
         }
 
         $allowlistEnv = getenv('HEALTH_IP_ALLOWLIST');
-        $allowlist = is_string($allowlistEnv) ? $allowlistEnv : '';
+        $allowlist = is_string($allowlistEnv) ? '' : $allowlistEnv;
 
         // Ta bort array_filter för att döda UnwrapArrayFilter.
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
Exakt IP i allowlist ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:76

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Ternary
Middlewares/IpAllowlist.php:51:9
 
         // Tog bort redundant (string) cast i true-grenen eftersom getenv garanterat är sträng där.
         $appEnvEnv = getenv('APP_ENV');
-        $env = (string)$appEnvEnv !== '' ? $appEnvEnv : 'production';
+        $env = (string)$appEnvEnv !== '' ? 'production' : $appEnvEnv;
 
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
killedBy: Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
I development ska middleware släppa igenom alla IP.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:261

FAILURES!
Tests: 13, Assertions: 16, Failures: 1.

[Survived] CastString
Middlewares/IpAllowlist.php:51:9
 
         // Tog bort redundant (string) cast i true-grenen eftersom getenv garanterat är sträng där.
         $appEnvEnv = getenv('APP_ENV');
-        $env = (string)$appEnvEnv !== '' ? $appEnvEnv : 'production';
+        $env = $appEnvEnv !== '' ? $appEnvEnv : 'production';
 
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);

[Killed] LogicalOrSingleSubExprNegation
Middlewares/IpAllowlist.php:56:9
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
 
         // Släpp igenom helt i local/development
-        if (in_array($env, ['local', 'development'], true) || $isLocal) {
+        if (in_array($env, ['local', 'development'], true) || !$isLocal) {
             return $next->handle($request);
         }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LogicalOrSingleSubExprNegation
Middlewares/IpAllowlist.php:56:9
         $isLocal = in_array($clientIp, ['127.0.0.1', '::1'], true);
 
         // Släpp igenom helt i local/development
-        if (in_array($env, ['local', 'development'], true) || $isLocal) {
+        if (!in_array($env, ['local', 'development'], true) || $isLocal) {
             return $next->handle($request);
         }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
Middlewares/IpAllowlist.php:57:13
 
         // Släpp igenom helt i local/development
         if (in_array($env, ['local', 'development'], true) || $isLocal) {
-            return $next->handle($request);
+            
         }
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBypassesInDevelopment
I development ska middleware släppa igenom alla IP.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:261

FAILURES!
Tests: 13, Assertions: 16, Failures: 1.

[Killed] Identical
Middlewares/IpAllowlist.php:64:13
         // Detta gör koden enklare och undviker Break_ mutant.
         foreach ($allowed as $rule) {
             // $rule är alltid string här
-            if ($rule === $clientIp) {
+            if ($rule !== $clientIp) {
                 return $next->handle($request);
             }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
Middlewares/IpAllowlist.php:65:17
         foreach ($allowed as $rule) {
             // $rule är alltid string här
             if ($rule === $clientIp) {
-                return $next->handle($request);
+                
             }
             if (str_contains($rule, '/')) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsExactIpInProduction
Exakt IP i allowlist ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:76

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] NotIdentical
Middlewares/IpAllowlist.php:70:17
             if (str_contains($rule, '/')) {
                 // Ändra till att hämta alla delar och validera antalet för att undvika IncrementInteger på limit.
                 $parts = explode('/', $rule);
-                if (count($parts) !== 2) {
+                if (count($parts) === 2) {
                     continue;
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:70:17
             if (str_contains($rule, '/')) {
                 // Ändra till att hämta alla delar och validera antalet för att undvika IncrementInteger på limit.
                 $parts = explode('/', $rule);
-                if (count($parts) !== 2) {
+                if (count($parts) !== 3) {
                     continue;
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] CastInt
Middlewares/IpAllowlist.php:75:17
                 }
                 [$subnet, $maskStr] = $parts;
 
-                $mask = (int) $maskStr;
+                $mask = $maskStr;
 
                 // IPv4-CIDR
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
TypeError: App\Middlewares\IpAllowlist::ipv6InCidr(): Argument #3 ($mask) must be of type int, string given, called in C:\Users\mats\PhpstormProjects\Radix\src\Middlewares\IpAllowlist.php on line 111

C:\Users\mats\PhpstormProjects\Radix\src\Middlewares\IpAllowlist.php:126
C:\Users\mats\PhpstormProjects\Radix\src\Middlewares\IpAllo

[Killed] LogicalAndAllSubExprNegation
Middlewares/IpAllowlist.php:79:21
 
                 // IPv4-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
+                    !filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4) && !filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4))
                 ) {
                     if ($mask < 0 || $mask > 32) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Middlewares/IpAllowlist.php:79:21
 
                 // IPv4-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
+                    !filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4))
                 ) {
                     if ($mask < 0 || $mask > 32) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalOrAllSubExprNegation
Middlewares/IpAllowlist.php:82:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                 ) {
-                    if ($mask < 0 || $mask > 32) {
+                    if (!($mask < 0) || !($mask > 32)) {
                     continue;
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LessThan
Middlewares/IpAllowlist.php:82:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV4)
                 ) {
-                    if ($mask < 0 || $mask > 32) {
+                    if ($mask <= 0 || $mask > 32) {
                     continue;
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsIpv4Cidr0InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsIpv4Cidr0InProduction
IP med /0 mask ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:248

FAILURES!
Tests: 12, Assertions: 15, Failures: 1.

[Killed] Minus
Middlewares/IpAllowlist.php:93:21
                     // filter_var har redan garanterat att dessa är giltiga IPv4-adresser.
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
-                    $maskLong = -1 << (32 - $mask);
+                    $maskLong = -1 << (32 + $mask);
                     $maskLong = $maskLong & 0xFFFFFFFF;
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:93:21
                     // filter_var har redan garanterat att dessa är giltiga IPv4-adresser.
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
-                    $maskLong = -1 << (32 - $mask);
+                    $maskLong = -0 << (32 - $mask);
                     $maskLong = $maskLong & 0xFFFFFFFF;
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Middlewares/IpAllowlist.php:94:21
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
                     $maskLong = -1 << (32 - $mask);
-                    $maskLong = $maskLong & 0xFFFFFFFF;
+                    $maskLong = $maskLong & 4294967294;
 
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksIpv4With32MaskDifference
IP som skiljer sig på sista biten ska blockeras vid /32 mask.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:220

FAILURES!
Tests: 10, Assertions: 13, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:94:21
                     // Vi castar till int för säkerhets skull (om ip2long returnerar false blir det 0).
 
                     $maskLong = -1 << (32 - $mask);
-                    $maskLong = $maskLong & 0xFFFFFFFF;
+                    $maskLong = $maskLong & 4294967296;
 
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] BitwiseAnd
Middlewares/IpAllowlist.php:98:21
 
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
                     // Detta dödar CastInt mutanten genom att ta bort den onödiga koden.
-                    if (($ipLong & $maskLong) === ($subnetLong & $maskLong)) {
+                    if (($ipLong | $maskLong) === ($subnetLong & $maskLong)) {
                         return $next->handle($request);
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] BitwiseAnd
Middlewares/IpAllowlist.php:98:21
 
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
                     // Detta dödar CastInt mutanten genom att ta bort den onödiga koden.
-                    if (($ipLong & $maskLong) === ($subnetLong & $maskLong)) {
+                    if (($ipLong & $maskLong) === ($subnetLong | $maskLong)) {
                         return $next->handle($request);
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] ReturnRemoval
Middlewares/IpAllowlist.php:99:25
                     // Ta bort explicita (int) castar då ipLong/subnetLong garanterat är int här.
                     // Detta dödar CastInt mutanten genom att ta bort den onödiga koden.
                     if (($ipLong & $maskLong) === ($subnetLong & $maskLong)) {
-                        return $next->handle($request);
+                        
                     }
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv4InProduction
IP inom IPv4-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:108

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
Middlewares/IpAllowlist.php:105:21
 
                 // IPv6-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
+                    !filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6) && !filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6))
                 ) {
                     if ($mask < 0 || $mask > 128) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Middlewares/IpAllowlist.php:105:21
 
                 // IPv6-CIDR
                 if (
-                    filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
-                    && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
+                    !filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6))
                 ) {
                     if ($mask < 0 || $mask > 128) {
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] LessThanNegotiation
Middlewares/IpAllowlist.php:108:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                 ) {
-                    if ($mask < 0 || $mask > 128) {
+                    if ($mask >= 0 || $mask > 128) {
                         continue;
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] GreaterThan
Middlewares/IpAllowlist.php:108:21
                     filter_var($clientIp, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                     && filter_var($subnet, FILTER_VALIDATE_IP, FILTER_FLAG_IPV6)
                 ) {
-                    if ($mask < 0 || $mask > 128) {
+                    if ($mask < 0 || $mask >= 128) {
                         continue;
                     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsIpv6Cidr128InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsIpv6Cidr128InProduction
IPv6 med /128 mask ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:175

FAILURES!
Tests: 7, Assertions: 10, Failures: 1.

[Killed] IfNegation
Middlewares/IpAllowlist.php:111:21
                     if ($mask < 0 || $mask > 128) {
                         continue;
                     }
-                    if ($this->ipv6InCidr($clientIp, $subnet, $mask)) {
-                        return $next->handle($request);
-                    }
+                    if (!$this->ipv6InCidr($clientIp, $subnet, $mask)) {
                 }
             }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] ReturnRemoval
Middlewares/IpAllowlist.php:112:25
                         continue;
                     }
                     if ($this->ipv6InCidr($clientIp, $subnet, $mask)) {
-                        return $next->handle($request);
+                        
                     }
                 }
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.
