[Killed] DecrementInteger
Middlewares/IpAllowlist.php:120:9
 
         // Om vi kommer hit har ingen regel matchat -> Forbidden
         $res = new Response();
-        $res->setStatusCode(403);
+        $res->setStatusCode(402);
         $res->setHeader('Content-Type', 'text/plain; charset=utf-8');
         $res->setBody('Forbidden');
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 402 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:120:9
 
         // Om vi kommer hit har ingen regel matchat -> Forbidden
         $res = new Response();
-        $res->setStatusCode(403);
+        $res->setStatusCode(404);
         $res->setHeader('Content-Type', 'text/plain; charset=utf-8');
         $res->setBody('Forbidden');
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
IP utanför allowlist ska blockeras i production.
Failed asserting that 404 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:89

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Middlewares/IpAllowlist.php:121:9
         // Om vi kommer hit har ingen regel matchat -> Forbidden
         $res = new Response();
         $res->setStatusCode(403);
-        $res->setHeader('Content-Type', 'text/plain; charset=utf-8');
+        
         $res->setBody('Forbidden');
         return $res;
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
Failed asserting that an array has the key 'Content-Type'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:94

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Middlewares/IpAllowlist.php:122:9
         $res = new Response();
         $res->setStatusCode(403);
         $res->setHeader('Content-Type', 'text/plain; charset=utf-8');
-        $res->setBody('Forbidden');
+        
         return $res;
     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksUnknownIpInProduction
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Forbidden'
+''

[Killed] DecrementInteger
Middlewares/IpAllowlist.php:132:9
         $subnetBin = $this->inet6ToBits($subnet);
 
         // Död kod borttagen. Castar till string för att hantera eventuell null (även om det inte borde ske).
-        return substr((string)$ipBin, 0, $mask) === substr((string)$subnetBin, 0, $mask);
+        return substr((string)$ipBin, -1, $mask) === substr((string)$subnetBin, 0, $mask);
     }
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] IncrementInteger
Middlewares/IpAllowlist.php:132:9
         $subnetBin = $this->inet6ToBits($subnet);
 
         // Död kod borttagen. Castar till string för att hantera eventuell null (även om det inte borde ske).
-        return substr((string)$ipBin, 0, $mask) === substr((string)$subnetBin, 0, $mask);
+        return substr((string)$ipBin, 0, $mask) === substr((string)$subnetBin, 1, $mask);
     }
 
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] Identical
Middlewares/IpAllowlist.php:138:9
     private function inet6ToBits(string $ip): ?string
     {
         $packed = @inet_pton($ip);
-        if ($packed === false) {
+        if ($packed !== false) {
             return null;
         }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksCidrIpv6OutsideRangeInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksCidrIpv6OutsideRangeInProduction
IP utanför IPv6-CIDR ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:134

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Killed] Foreach_
Middlewares/IpAllowlist.php:142:9
             return null;
         }
         $bits = '';
-        foreach (str_split($packed) as $char) {
-            // Använd konstant för att undvika mutation av "magiska siffror"
-            $bits .= str_pad(decbin(ord($char)), self::BITS_PER_BYTE, '0', STR_PAD_LEFT);
-        }
+        foreach ([] as $char) {
         return $bits;
     }
killedBy: Radix\Tests\Api\IpAllowlistTest::testBlocksCidrIpv6OutsideRangeInProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testBlocksCidrIpv6OutsideRangeInProduction
IP utanför IPv6-CIDR ska blockeras i production.
Failed asserting that 200 is identical to 403.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:134

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Killed] Assignment
Middlewares/IpAllowlist.php:144:13
         $bits = '';
         foreach (str_split($packed) as $char) {
             // Använd konstant för att undvika mutation av "magiska siffror"
-            $bits .= str_pad(decbin(ord($char)), self::BITS_PER_BYTE, '0', STR_PAD_LEFT);
+            $bits = str_pad(decbin(ord($char)), self::BITS_PER_BYTE, '0', STR_PAD_LEFT);
         }
         return $bits;
killedBy: Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
statusReason: 1) Radix\Tests\Api\IpAllowlistTest::testAllowsCidrIpv6InProduction
IP inom IPv6-CIDR ska tillåtas i production.
Failed asserting that 403 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\IpAllowlistTest.php:121

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.
