[Killed] LogicalAnd
Middlewares/RequestId.php:17:9
 
     public function process(Request $request, \Radix\Http\RequestHandlerInterface $next): Response
     {
-        $requestId = isset($_SERVER['HTTP_X_REQUEST_ID']) && is_string($_SERVER['HTTP_X_REQUEST_ID'])
+        $requestId = isset($_SERVER['HTTP_X_REQUEST_ID']) || is_string($_SERVER['HTTP_X_REQUEST_ID'])
             ? $_SERVER['HTTP_X_REQUEST_ID']
             : bin2hex(random_bytes(12));
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.2a6514daf341c28ea6c7f555abea61b0.infection.xml

W
Notice: fwrite(): Write of 119 bytes failed with errno=13 Permission denied in C:\Users\mats\PhpstormProjects\Radix\vendor\infection\include-interceptor\src\IncludeInterceptor.php on line 3

[Killed] LogicalAndAllSubExprNegation
Middlewares/RequestId.php:17:9
 
     public function process(Request $request, \Radix\Http\RequestHandlerInterface $next): Response
     {
-        $requestId = isset($_SERVER['HTTP_X_REQUEST_ID']) && is_string($_SERVER['HTTP_X_REQUEST_ID'])
+        $requestId = !isset($_SERVER['HTTP_X_REQUEST_ID']) && !is_string($_SERVER['HTTP_X_REQUEST_ID'])
             ? $_SERVER['HTTP_X_REQUEST_ID']
             : bin2hex(random_bytes(12));
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
InvalidArgumentException: Header value must be a scalar, null given.

C:\Users\mats\PhpstormProjects\Radix\framework\src\Http\Response.php:29
C:\Users\mats\PhpstormProjects\Radix\src\Middlewares\RequestId.php:28
C:\Users\mats\PhpstormProjects\Radix\framework\src\Middleware\MiddlewareRequestHandler.php:30
C:\Users\mats\Phpst

[Killed] DecrementInteger
Middlewares/RequestId.php:19:13
     {
         $requestId = isset($_SERVER['HTTP_X_REQUEST_ID']) && is_string($_SERVER['HTTP_X_REQUEST_ID'])
             ? $_SERVER['HTTP_X_REQUEST_ID']
-            : bin2hex(random_bytes(12));
+            : bin2hex(random_bytes(11));
         $_SERVER['HTTP_X_REQUEST_ID'] = $requestId;
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Generated Request ID should be 24 chars long (12 bytes hex)
Failed asserting that 22 is identical to 24.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:192

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] IncrementInteger
Middlewares/RequestId.php:19:13
     {
         $requestId = isset($_SERVER['HTTP_X_REQUEST_ID']) && is_string($_SERVER['HTTP_X_REQUEST_ID'])
             ? $_SERVER['HTTP_X_REQUEST_ID']
-            : bin2hex(random_bytes(12));
+            : bin2hex(random_bytes(13));
         $_SERVER['HTTP_X_REQUEST_ID'] = $requestId;
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Generated Request ID should be 24 chars long (12 bytes hex)
Failed asserting that 26 is identical to 24.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:192

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] CastInt
Middlewares/RequestId.php:27:9
         $response = $next->handle($request);
 
         // Använd trunkering (floor) istället för round för att förenkla och undvika mutations-flakiness
-        $durationMs = (int) ((microtime(true) - $start) * self::MS_FACTOR);
+        $durationMs = (microtime(true) - $start) * self::MS_FACTOR;
         $response->setHeader('X-Request-Id', $requestId);
         $response->setHeader('X-Response-Time', $durationMs . 'ms');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that '12.408018112183ms' matches PCRE pattern "/^\d+ms$/".

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:202

FAILURES!
Tests: 1, Assertions: 9, Failures: 1.

[Killed] Minus
Middlewares/RequestId.php:27:9
         $response = $next->handle($request);
 
         // Använd trunkering (floor) istället för round för att förenkla och undvika mutations-flakiness
-        $durationMs = (int) ((microtime(true) - $start) * self::MS_FACTOR);
+        $durationMs = (int) ((microtime(true) + $start) * self::MS_FACTOR);
         $response->setHeader('X-Request-Id', $requestId);
         $response->setHeader('X-Response-Time', $durationMs . 'ms');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Response time should be reasonable (< 10s), not a timestamp
Failed asserting that 3527302240982 is less than 10000.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:206

FAILURES!
Tests: 1, Assertions: 10, Failures: 1.

[Killed] MethodCallRemoval
Middlewares/RequestId.php:28:9
 
         // Använd trunkering (floor) istället för round för att förenkla och undvika mutations-flakiness
         $durationMs = (int) ((microtime(true) - $start) * self::MS_FACTOR);
-        $response->setHeader('X-Request-Id', $requestId);
+        
         $response->setHeader('X-Response-Time', $durationMs . 'ms');
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'X-Request-Id'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:185

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Middlewares/RequestId.php:29:9
         // Använd trunkering (floor) istället för round för att förenkla och undvika mutations-flakiness
         $durationMs = (int) ((microtime(true) - $start) * self::MS_FACTOR);
         $response->setHeader('X-Request-Id', $requestId);
-        $response->setHeader('X-Response-Time', $durationMs . 'ms');
+        $response->setHeader('X-Response-Time', $durationMs);
 
         return $response;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that '12' ends with "ms".

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:199

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Middlewares/RequestId.php:29:9
         // Använd trunkering (floor) istället för round för att förenkla och undvika mutations-flakiness
         $durationMs = (int) ((microtime(true) - $start) * self::MS_FACTOR);
         $response->setHeader('X-Request-Id', $requestId);
-        $response->setHeader('X-Response-Time', $durationMs . 'ms');
+        
 
         return $response;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that an array has the key 'X-Response-Time'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:194

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
