[Killed] PublicVisibility
Models/Status.php:95:5
         return null;
     }
 
-    public function getActiveAtAttribute(?int $value): ?string
+    protected function getActiveAtAttribute(?int $value): ?string
     {
         // Om värdet är null, returnera null, annars formatera som läsbart datum
killedBy: Radix\Tests\StatusTest::testGetActiveAtAttributeIsPublic
statusReason: 1) Radix\Tests\StatusTest::testGetActiveAtAttributeIsPublic
Error: Call to protected method App\Models\Status::getActiveAtAttribute() from scope Radix\Tests\StatusTest

C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:101

ERRORS!
Tests: 7, Assertions: 12, Errors: 1.

[Killed] Ternary
Models/Status.php:98:9
     public function getActiveAtAttribute(?int $value): ?string
     {
         // Om värdet är null, returnera null, annars formatera som läsbart datum
-        return $value ? date('Y-m-d H:i:s', (int) $value) : null;
+        return $value ? null : date('Y-m-d H:i:s', (int) $value);
     }
 
killedBy: Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
statusReason: 1) Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
ActiveAt ska returnera ett datum, inte null när värdet är satt.
Failed asserting that null is not null.

C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:25

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Models/Status.php:101:5
         return $value ? date('Y-m-d H:i:s', (int) $value) : null;
     }
 
-    public function setActiveAtAttribute(int|float|string|null $value): void
+    protected function setActiveAtAttribute(int|float|string|null $value): void
     {
         if (is_null($value)) {
killedBy: Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
statusReason: 1) Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
Error: Call to protected method App\Models\Status::setActiveAtAttribute() from scope Radix\Tests\StatusTest

C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IfNegation
Models/Status.php:103:9
 
     public function setActiveAtAttribute(int|float|string|null $value): void
     {
-        if (is_null($value)) {
-            $this->attributes['active_at'] = null;
-        } elseif (is_numeric($value) && $value > 0) {
-            $this->attributes['active_at'] = (int) $value;
-        } elseif (is_string($value) && strtotime($value)) {
-            $this->attributes['active_at'] = strtotime($value);
-        } else {
-            throw new InvalidArgumentException("Ogiltigt värde för active_at: $value");
-        }
+        if (!is_null($value)) {
     }
 
killedBy: Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
statusReason: 1) Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
ActiveAt ska returnera ett datum, inte null när värdet är satt.
Failed asserting that null is not null.

C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:25

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThan
Models/Status.php:105:9
     {
         if (is_null($value)) {
             $this->attributes['active_at'] = null;
-        } elseif (is_numeric($value) && $value > 0) {
+        } elseif (is_numeric($value) && $value >= 0) {
             $this->attributes['active_at'] = (int) $value;
         } elseif (is_string($value) && strtotime($value)) {
killedBy: Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForZero
statusReason: 1) Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForZero
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 8, Assertions: 14, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
Models/Status.php:105:9
     {
         if (is_null($value)) {
             $this->attributes['active_at'] = null;
-        } elseif (is_numeric($value) && $value > 0) {
+        } elseif (!is_numeric($value) && !($value > 0)) {
             $this->attributes['active_at'] = (int) $value;
         } elseif (is_string($value) && strtotime($value)) {
killedBy: Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
statusReason: 1) Radix\Tests\StatusTest::testGetActiveAtAttributeReturnsFormattedDate
InvalidArgumentException: Ogiltigt värde för active_at: 1672531200

C:\Users\mats\PhpstormProjects\Radix\src\Models\Status.php:110
C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] CastInt
Models/Status.php:106:13
         if (is_null($value)) {
             $this->attributes['active_at'] = null;
         } elseif (is_numeric($value) && $value > 0) {
-            $this->attributes['active_at'] = (int) $value;
+            $this->attributes['active_at'] = $value;
         } elseif (is_string($value) && strtotime($value)) {
             $this->attributes['active_at'] = strtotime($value);
killedBy: Radix\Tests\StatusTest::testSetActiveAtCastsNumericStringToInteger
statusReason: 1) Radix\Tests\StatusTest::testSetActiveAtCastsNumericStringToInteger
Attributet active_at ska lagras som integer.
Failed asserting that '1672531200' is of type int.

C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:56

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Models/Status.php:107:9
             $this->attributes['active_at'] = null;
         } elseif (is_numeric($value) && $value > 0) {
             $this->attributes['active_at'] = (int) $value;
-        } elseif (is_string($value) && strtotime($value)) {
+        } elseif (is_string($value) && !strtotime($value)) {
             $this->attributes['active_at'] = strtotime($value);
         } else {
killedBy: Radix\Tests\StatusTest::testSetActiveAtParsesValidDateString
statusReason: 1) Radix\Tests\StatusTest::testSetActiveAtParsesValidDateString
InvalidArgumentException: Ogiltigt värde för active_at: 2023-05-01 12:00:00

C:\Users\mats\PhpstormProjects\Radix\src\Models\Status.php:110
C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:88

ERRORS!
Tests: 6, Assertions: 11, Errors: 1.

[Killed] LogicalAndNegation
Models/Status.php:107:9
             $this->attributes['active_at'] = null;
         } elseif (is_numeric($value) && $value > 0) {
             $this->attributes['active_at'] = (int) $value;
-        } elseif (is_string($value) && strtotime($value)) {
+        } elseif (!(is_string($value) && strtotime($value))) {
             $this->attributes['active_at'] = strtotime($value);
         } else {
killedBy: Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForNegativeNumbers
statusReason: 1) Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForNegativeNumbers
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "strtotime(): Argument #1 ($datetime) must be of type string, int given" at
C:\Users\mats\PhpstormProjects\Radix\src\Models\Status.php:108
C:\Users\mats\PhpstormProjects\Radix\tests\StatusTest.php:76
.

F

[Killed] Throw_
Models/Status.php:110:13
         } elseif (is_string($value) && strtotime($value)) {
             $this->attributes['active_at'] = strtotime($value);
         } else {
-            throw new InvalidArgumentException("Ogiltigt värde för active_at: $value");
+            new InvalidArgumentException("Ogiltigt värde för active_at: $value");
         }
     }
killedBy: Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForNegativeNumbers
statusReason: 1) Radix\Tests\StatusTest::testSetActiveAtThrowsExceptionForNegativeNumbers
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.
