[Killed] PublicVisibility
Models/User.php:38:5
     protected array $guarded = ['password', 'role', 'deleted_at'];
     //protected array $autoloadRelations = ['status'];
 
-    public function setPasswordAttribute(string $value): void
+    protected function setPasswordAttribute(string $value): void
     {
         // Kontrollera om värdet redan är hashat
killedBy: Radix\Tests\UserRoleTest::testSetPasswordAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testSetPasswordAttributeIsPublic
Error: Call to protected method App\Models\User::setPasswordAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:455

ERRORS!
Tests: 72, Assertions: 283, Errors: 1.

[Killed] LogicalNot
Models/User.php:41:9
     public function setPasswordAttribute(string $value): void
     {
         // Kontrollera om värdet redan är hashat
-        if (!password_get_info($value)['algo']) {
+        if (password_get_info($value)['algo']) {
             // Endast hash lösenord som inte redan är hashat
             $this->attributes['password'] = password_hash($value, PASSWORD_DEFAULT);
killedBy: Radix\Tests\UserRoleTest::testSetPasswordAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testSetPasswordAttributeIsPublic
Failed asserting that two strings are not identical.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:463

FAILURES!
Tests: 72, Assertions: 285, Failures: 1.

[Killed] PublicVisibility
Models/User.php:66:5
     }
 
     // Hantera första bokstaven som stor bokstav för förnamn
-    public function setFirstNameAttribute(string $value): void
+    protected function setFirstNameAttribute(string $value): void
     {
         $this->attributes['first_name'] = human_name($value);
killedBy: Radix\Tests\UserRoleTest::testSetFirstNameAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testSetFirstNameAttributeIsPublic
Error: Call to protected method App\Models\User::setFirstNameAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:446

ERRORS!
Tests: 71, Assertions: 282, Errors: 1.

[Killed] PublicVisibility
Models/User.php:72:5
     }
 
     // Hantera första bokstaven som stor bokstav för efternamn
-    public function setLastNameAttribute(string $value): void
+    protected function setLastNameAttribute(string $value): void
     {
         $this->attributes['last_name'] = human_name($value);
killedBy: Radix\Tests\UserRoleTest::testSetLastNameAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testSetLastNameAttributeIsPublic
Error: Call to protected method App\Models\User::setLastNameAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:438

ERRORS!
Tests: 70, Assertions: 281, Errors: 1.

[Killed] PublicVisibility
Models/User.php:78:5
     }
 
     // Accessor för att hämta förnamnet i rätt format (kan vara identitet om settern redan normaliserar)
-    public function getFirstNameAttribute(?string $value): ?string
+    protected function getFirstNameAttribute(?string $value): ?string
     {
         return $value ?? null;
killedBy: Radix\Tests\UserRoleTest::testGetFirstNameAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testGetFirstNameAttributeIsPublic
Error: Call to protected method App\Models\User::getFirstNameAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:430

ERRORS!
Tests: 69, Assertions: 280, Errors: 1.

[Killed] PublicVisibility
Models/User.php:84:5
     }
 
     // Accessor för att hämta efternamnet i rätt format
-    public function getLastNameAttribute(?string $value): ?string
+    protected function getLastNameAttribute(?string $value): ?string
     {
         return $value ?? null;
killedBy: Radix\Tests\UserRoleTest::testGetLastNameAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testGetLastNameAttributeIsPublic
Error: Call to protected method App\Models\User::getLastNameAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:423

ERRORS!
Tests: 68, Assertions: 279, Errors: 1.

[Killed] PublicVisibility
Models/User.php:90:5
     }
 
     // Hantera e-postlagring i små bokstäver
-    public function setEmailAttribute(string $value): void
+    protected function setEmailAttribute(string $value): void
     {
         $this->attributes['email'] = mb_strtolower(trim($value));
killedBy: Radix\Tests\UserRoleTest::testSetEmailAttributeTrimsWhitespace
statusReason: 1) Radix\Tests\UserRoleTest::testSetEmailAttributeTrimsWhitespace
Error: Call to protected method App\Models\User::setEmailAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:400

ERRORS!
Tests: 66, Assertions: 277, Errors: 1.

[Killed] UnwrapTrim
Models/User.php:92:9
     // Hantera e-postlagring i små bokstäver
     public function setEmailAttribute(string $value): void
     {
-        $this->attributes['email'] = mb_strtolower(trim($value));
+        $this->attributes['email'] = mb_strtolower($value);
     }
 
killedBy: Radix\Tests\UserRoleTest::testSetEmailAttributeTrimsWhitespace
statusReason: 1) Radix\Tests\UserRoleTest::testSetEmailAttributeTrimsWhitespace
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'test@example.com'
+'  test@example.com  '

[Killed] PublicVisibility
Models/User.php:96:5
     }
 
     // Accessor för att hämta e-post (texten ska redan vara korrekt formaterad)
-    public function getEmailAttribute(?string $value): ?string
+    protected function getEmailAttribute(?string $value): ?string
     {
         return $value ?? null; // Returnera null om det inte finns
killedBy: Radix\Tests\UserRoleTest::testGetEmailAttributeIsPublic
statusReason: 1) Radix\Tests\UserRoleTest::testGetEmailAttributeIsPublic
Error: Call to protected method App\Models\User::getEmailAttribute() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:392

ERRORS!
Tests: 65, Assertions: 276, Errors: 1.

[Killed] PublicVisibility
Models/User.php:107:5
      * @return \Radix\Database\ORM\Relationships\HasOne
      * @phpstan-return \Radix\Database\ORM\Relationships\HasOne
      */
-    public function status(): \Radix\Database\ORM\Relationships\HasOne
+    protected function status(): \Radix\Database\ORM\Relationships\HasOne
     {
         return $this->hasOne(Status::class, 'user_id', 'id');
killedBy: Radix\Tests\Api\UserControllerTest::testGet
statusReason: 1) Radix\Tests\Api\UserControllerTest::testGet
Error: Call to protected method App\Models\User::status() from scope Radix\Database\QueryBuilder\AbstractQueryBuilder

C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\QueryBuilder\AbstractQueryBuilder.php:92
C:\Users\mats\PhpstormProjects\Radix\framework\src\Database\QueryBuilder\QueryBuilder.php:171
C:\Users\mats\PhpstormProjects\Radix\fr

[Killed] PublicVisibility
Models/User.php:178:5
     }
 
     // Rollen som enum
-    public function roleEnum(): ?Role
+    protected function roleEnum(): ?Role
     {
         // Läs direkt från attribut om det finns där (t.ex. efter setRole i minnet)
killedBy: Radix\Tests\UserRoleTest::testRoleEnumAccessor
statusReason: 1) Radix\Tests\UserRoleTest::testRoleEnumAccessor
Error: Call to protected method App\Models\User::roleEnum() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:231

ERRORS!
Tests: 11, Assertions: 38, Errors: 1.

[Killed] LogicalAndAllSubExprNegation
Models/User.php:181:9
     public function roleEnum(): ?Role
     {
         // Läs direkt från attribut om det finns där (t.ex. efter setRole i minnet)
-        if (isset($this->attributes['role']) && is_string($this->attributes['role'])) {
+        if (!isset($this->attributes['role']) && !is_string($this->attributes['role'])) {
             return Role::tryFrom($this->attributes['role']);
         }
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
TypeError: Radix\Enums\Role::tryFrom(): Argument #1 ($value) must be of type string, null given

C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:182
C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:208
C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:224
C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.ph

[Killed] LogicalAnd
Models/User.php:181:9
     public function roleEnum(): ?Role
     {
         // Läs direkt från attribut om det finns där (t.ex. efter setRole i minnet)
-        if (isset($this->attributes['role']) && is_string($this->attributes['role'])) {
+        if (isset($this->attributes['role']) || is_string($this->attributes['role'])) {
             return Role::tryFrom($this->attributes['role']);
         }
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.0ce820f01a181323ffb329c51ea3d5ab.infection.xml

W
Notice: fwrite(): Write of 105 bytes failed with errno=13 Permission denied in C:\Users\mats\PhpstormProjects\Radix\vendor\infection\include-interceptor\src\IncludeInterceptor.php on line 3

[Killed] ReturnRemoval
Models/User.php:182:13
     {
         // Läs direkt från attribut om det finns där (t.ex. efter setRole i minnet)
         if (isset($this->attributes['role']) && is_string($this->attributes['role'])) {
-            return Role::tryFrom($this->attributes['role']);
+            
         }
 
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Objektet i minnet ska spegla ändringen direkt.
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:123

FAILURES!
Tests: 2, Assertions: 8, Failures: 1.

[Killed] Ternary
Models/User.php:190:9
         } catch (InvalidArgumentException) {
             return null;
         }
-        return is_string($value) ? Role::tryFrom($value) : null;
+        return is_string($value) ? null : Role::tryFrom($value);
     }
 
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:100

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Models/User.php:194:5
     }
 
     // Sätt roll via enum eller sträng
-    public function setRole(Role|string $role): void
+    protected function setRole(Role|string $role): void
     {
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Error: Call to protected method App\Models\User::setRole() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:122

ERRORS!
Tests: 2, Assertions: 7, Errors: 1.

[Killed] InstanceOf_
Models/User.php:196:9
     // Sätt roll via enum eller sträng
     public function setRole(Role|string $role): void
     {
-        $enum = $role instanceof Role ? $role : Role::tryFromName($role);
+        $enum = !$role instanceof Role ? $role : Role::tryFromName($role);
         if (!$enum) {
             $roleLabel = $role instanceof Role ? $role->name : $role;
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Objektet i minnet ska spegla ändringen direkt.
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:123

--

[Killed] Ternary
Models/User.php:196:9
     // Sätt roll via enum eller sträng
     public function setRole(Role|string $role): void
     {
-        $enum = $role instanceof Role ? $role : Role::tryFromName($role);
+        $enum = $role instanceof Role ? Role::tryFromName($role) : $role;
         if (!$enum) {
             $roleLabel = $role instanceof Role ? $role->name : $role;
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Objektet i minnet ska spegla ändringen direkt.
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:123

--

[Killed] LogicalNot
Models/User.php:197:9
     public function setRole(Role|string $role): void
     {
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
-        if (!$enum) {
+        if ($enum) {
             $roleLabel = $role instanceof Role ? $role->name : $role;
             throw new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
InvalidArgumentException: Ogiltig roll: admin

C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:199
C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:122

ERRORS!
Tests: 2, Assertions: 7, Errors: 1.

[Killed] Ternary
Models/User.php:198:13
     {
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
         if (!$enum) {
-            $roleLabel = $role instanceof Role ? $role->name : $role;
+            $roleLabel = $role instanceof Role ? $role : $role->name;
             throw new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
         }
killedBy: Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
statusReason: 1) Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
Failed asserting that exception message 'Ogiltig roll: ' contains 'Ogiltig roll: superadmin'.

--

1 test triggered 1 PHP warning:

1) C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:198

[Killed] InstanceOf_
Models/User.php:198:13
     {
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
         if (!$enum) {
-            $roleLabel = $role instanceof Role ? $role->name : $role;
+            $roleLabel = !$role instanceof Role ? $role->name : $role;
             throw new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
         }
killedBy: Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
statusReason: 1) Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
Failed asserting that exception message 'Ogiltig roll: ' contains 'Ogiltig roll: superadmin'.

--

1 test triggered 1 PHP warning:

1) C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:198

[Killed] ConcatOperandRemoval
Models/User.php:199:13
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
         if (!$enum) {
             $roleLabel = $role instanceof Role ? $role->name : $role;
-            throw new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
+            throw new InvalidArgumentException('Ogiltig roll: ');
         }
         $this->attributes['role'] = $enum->value;
killedBy: Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
statusReason: 1) Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
Failed asserting that exception message 'Ogiltig roll: ' contains 'Ogiltig roll: superadmin'.

FAILURES!
Tests: 12, Assertions: 42, Failures: 1.

[Killed] Throw_
Models/User.php:199:13
         $enum = $role instanceof Role ? $role : Role::tryFromName($role);
         if (!$enum) {
             $roleLabel = $role instanceof Role ? $role->name : $role;
-            throw new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
+            new InvalidArgumentException('Ogiltig roll: ' . $roleLabel);
         }
         $this->attributes['role'] = $enum->value;
killedBy: Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
statusReason: 1) Radix\Tests\UserRoleTest::testSetRoleWithInvalidValueThrows
Failed asserting that exception of type "InvalidArgumentException" is thrown.

--

1 test triggered 1 PHP warning:

1) C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:201

[Killed] PublicVisibility
Models/User.php:205:5
     }
 
     // Exakt match
-    public function hasRole(Role|string $role): bool
+    protected function hasRole(Role|string $role): bool
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
killedBy: Radix\Tests\UserRoleTest::testHasRoleWithString
statusReason: 1) Radix\Tests\UserRoleTest::testHasRoleWithString
Error: Call to protected method App\Models\User::hasRole() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:168

ERRORS!
Tests: 4, Assertions: 19, Errors: 1.

[Killed] InstanceOf_
Models/User.php:207:9
     // Exakt match
     public function hasRole(Role|string $role): bool
     {
-        $target = $role instanceof Role ? $role : Role::tryFromName($role);
+        $target = !$role instanceof Role ? $role : Role::tryFromName($role);
         $current = $this->roleEnum();
         return $target !== null && $current?->value === $target->value;
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
TypeError: Radix\Enums\Role::tryFromName(): Argument #1 ($role) must be of type string, Radix\Enums\Role given, called in C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php on line 207

C:\Users\mats\PhpstormProjects\Radix\framework\src\Enums\Role.php:26
C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:207
C:\Users\mats\Ph

[Killed] Ternary
Models/User.php:207:9
     // Exakt match
     public function hasRole(Role|string $role): bool
     {
-        $target = $role instanceof Role ? $role : Role::tryFromName($role);
+        $target = $role instanceof Role ? Role::tryFromName($role) : $role;
         $current = $this->roleEnum();
         return $target !== null && $current?->value === $target->value;
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
TypeError: Radix\Enums\Role::tryFromName(): Argument #1 ($role) must be of type string, Radix\Enums\Role given, called in C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php on line 207

C:\Users\mats\PhpstormProjects\Radix\framework\src\Enums\Role.php:26
C:\Users\mats\PhpstormProjects\Radix\src\Models\User.php:207
C:\Users\mats\Ph

[Killed] Identical
Models/User.php:209:9
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
         $current = $this->roleEnum();
-        return $target !== null && $current?->value === $target->value;
+        return $target !== null && $current?->value !== $target->value;
     }
 
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that true is false.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:101

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] NullSafePropertyCall
Models/User.php:209:9
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
         $current = $this->roleEnum();
-        return $target !== null && $current?->value === $target->value;
+        return $target !== null && $current->value === $target->value;
     }
 
killedBy: Radix\Tests\UserRoleTest::testHasRoleReturnsFalseWhenUserHasNoRole
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.f68349e511bd0a1f1d8da461d1d695a7.infection.xml

...................W
Notice: fwrite(): Write of 1316 bytes failed with errno=13 Permission denied in C:\Users\mats\PhpstormProjects\Radix\vendor\infection\include-interceptor\src\IncludeInter

[Killed] PublicVisibility
Models/User.php:213:5
     }
 
     // Miniminivå (om du vill ha hierarki; t.ex. admin >= user)
-    public function hasAtLeast(Role|string $role): bool
+    protected function hasAtLeast(Role|string $role): bool
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
killedBy: Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
statusReason: 1) Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
Error: Call to protected method App\Models\User::hasAtLeast() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:204

ERRORS!
Tests: 8, Assertions: 30, Errors: 1.

[Killed] LogicalAnd
Models/User.php:217:9
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
         $current = $this->roleEnum();
-        return $target !== null && $current !== null && $current->level() >= $target->level();
+        return $target !== null && $current !== null || $current->level() >= $target->level();
     }
 
killedBy: Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
statusReason: 1) Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
Failed asserting that true is false.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:207

FAILURES!
Tests: 8, Assertions: 34, Failures: 1.

[Killed] LogicalAndNegation
Models/User.php:217:9
     {
         $target = $role instanceof Role ? $role : Role::tryFromName($role);
         $current = $this->roleEnum();
-        return $target !== null && $current !== null && $current->level() >= $target->level();
+        return !($target !== null && $current !== null && $current->level() >= $target->level());
     }
 
killedBy: Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
statusReason: 1) Radix\Tests\UserRoleTest::testHasAtLeastRoleHierarchy
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:204

FAILURES!
Tests: 8, Assertions: 31, Failures: 1.

[Killed] PublicVisibility
Models/User.php:221:5
     }
 
     // Någon av flera roller
-    public function hasAnyRole(Role|string ...$roles): bool
+    protected function hasAnyRole(Role|string ...$roles): bool
     {
         foreach ($roles as $r) {
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Error: Call to protected method App\Models\User::hasAnyRole() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:100

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
Models/User.php:223:9
     // Någon av flera roller
     public function hasAnyRole(Role|string ...$roles): bool
     {
-        foreach ($roles as $r) {
-            if ($this->hasRole($r)) {
-                return true;
-            }
-        }
+        foreach ([] as $r) {
         return false;
     }
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:100

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
Models/User.php:224:13
     public function hasAnyRole(Role|string ...$roles): bool
     {
         foreach ($roles as $r) {
-            if ($this->hasRole($r)) {
-                return true;
-            }
+            if (!$this->hasRole($r)) {
         }
         return false;
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that true is false.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:101

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
Models/User.php:225:17
     {
         foreach ($roles as $r) {
             if ($this->hasRole($r)) {
-                return true;
+                
             }
         }
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:100

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Models/User.php:225:17
     {
         foreach ($roles as $r) {
             if ($this->hasRole($r)) {
-                return true;
+                return false;
             }
         }
killedBy: Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
statusReason: 1) Radix\Tests\UserRoleTest::testHasAnyRoleMixedTypesAndEdges
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:100

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Models/User.php:232:5
     }
 
     // Syntaktiskt socker
-    public function isAdmin(): bool
+    protected function isAdmin(): bool
     {
         return $this->hasRole(Role::Admin);
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Error: Call to protected method App\Models\User::isAdmin() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:119

ERRORS!
Tests: 2, Assertions: 6, Errors: 1.

[Killed] PublicVisibility
Models/User.php:237:5
         return $this->hasRole(Role::Admin);
     }
 
-    public function isModerator(): bool
+    protected function isModerator(): bool
     {
         return $this->hasRole(Role::Moderator);
killedBy: Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
statusReason: 1) Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
Error: Call to protected method App\Models\User::isModerator() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:336

ERRORS!
Tests: 17, Assertions: 86, Errors: 1.

[Killed] PublicVisibility
Models/User.php:242:5
         return $this->hasRole(Role::Moderator);
     }
 
-    public function isEditor(): bool
+    protected function isEditor(): bool
     {
         return $this->hasRole(Role::Editor);
killedBy: Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
statusReason: 1) Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
Error: Call to protected method App\Models\User::isEditor() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:329

ERRORS!
Tests: 17, Assertions: 81, Errors: 1.

[Killed] PublicVisibility
Models/User.php:247:5
         return $this->hasRole(Role::Editor);
     }
 
-    public function isSupport(): bool
+    protected function isSupport(): bool
     {
         return $this->hasRole(Role::Support);
killedBy: Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
statusReason: 1) Radix\Tests\UserRoleTest::testIsHelpersForNewRoles
Error: Call to protected method App\Models\User::isSupport() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:334

ERRORS!
Tests: 17, Assertions: 84, Errors: 1.

[Killed] PublicVisibility
Models/User.php:252:5
         return $this->hasRole(Role::Support);
     }
 
-    public function isUser(): bool
+    protected function isUser(): bool
     {
         return $this->hasRole(Role::User);
killedBy: Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
statusReason: 1) Radix\Tests\UserRoleTest::testSetRolePersistsWithSaveAndReload
Error: Call to protected method App\Models\User::isUser() from scope Radix\Tests\UserRoleTest

C:\Users\mats\PhpstormProjects\Radix\tests\UserRoleTest.php:118

ERRORS!
Tests: 2, Assertions: 5, Errors: 1.
