[Killed] Coalesce
Services/HealthCheckService.php:17:9
     public function __construct(?\Radix\Support\Logger $logger = null)
     {
         // Tillåt DI, fall back om ej satt
-        $this->logger = $logger ?? new \Radix\Support\Logger('health');
+        $this->logger = new \Radix\Support\Logger('health') ?? $logger;
     }
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
Expected logs to be written
Failed asserting that an array is not empty.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:679

FAILURES!
Tests: 13, Assertions: 41, Failures: 1.

[Killed] PublicVisibility
Services/HealthCheckService.php:23:5
     /**
      * @return array<string, string|bool>
      */
-    public function run(): array
+    protected function run(): array
     {
         $ok = true;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Error: Call to protected method App\Services\HealthCheckService::run() from scope App\Controllers\Api\HealthController

C:\Users\mats\PhpstormProjects\Radix\src\Controllers\Api\HealthController.php:31
C:\Users\mats\PhpstormProjects\Radix\framework\src\Http\RequestHandler.php:38
C:\Users\mats\PhpstormProjects\Radix\framework

[Killed] TrueValue
Services/HealthCheckService.php:25:9
      */
     public function run(): array
     {
-        $ok = true;
+        $ok = false;
         $checks = [
             'php' => PHP_VERSION,
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Services/HealthCheckService.php:31:9
             'time' => date('c'),
         ];
 
-        $this->log('start php={php} time={time}', ['php' => $checks['php'], 'time' => $checks['time']]);
+        
 
         // DB
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
Context should contain "php" key
Failed asserting that an array has the key 'php'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:686

FAILURES!
Tests: 13, Assertions: 42, Failures: 1.

[Killed] ArrayItemRemoval
Services/HealthCheckService.php:31:9
             'time' => date('c'),
         ];
 
-        $this->log('start php={php} time={time}', ['php' => $checks['php'], 'time' => $checks['time']]);
+        $this->log('start php={php} time={time}', ['time' => $checks['time']]);
 
         // DB
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
Context should contain "php" key
Failed asserting that an array has the key 'php'.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:686

FAILURES!
Tests: 13, Assertions: 42, Failures: 1.

[Killed] IfNegation
Services/HealthCheckService.php:35:13
 
         // DB
         try {
-            if (function_exists('app')) {
-                /** @var \Radix\Database\DatabaseManager $dbm */
-                $dbm = app(\Radix\Database\DatabaseManager::class);
-                $conn = $dbm->connection();
-                $conn->execute('SELECT 1');
-                $checks['db'] = 'ok';
-                $this->log('db=ok');
-            } else {
-                $checks['db'] = 'skipped';
-                // VIKTIGT: Ta bort loggningen här som orsakade mutationen vi inte kunde döda
-                // $this->log('db=skipped (no app())'); <-- BORTTAGEN
-            }
+            if (!function_exists('app')) {
         } catch (Throwable $e) {
             $ok = false;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthCheckExecutesDatabaseQuery
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthCheckExecutesDatabaseQuery
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 16, Assertions: 49, Failures: 1.

[Killed] MethodCallRemoval
Services/HealthCheckService.php:39:17
                 /** @var \Radix\Database\DatabaseManager $dbm */
                 $dbm = app(\Radix\Database\DatabaseManager::class);
                 $conn = $dbm->connection();
-                $conn->execute('SELECT 1');
+                
                 $checks['db'] = 'ok';
                 $this->log('db=ok');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthValidatesTokenWhenRequiredIsOnString
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.aa5e14ecb66a26c9ee73b1236ba75ad0.infection.xml

...........W
Notice: fwrite(): Write of 1135 bytes failed with errno=13 Permission denied in C:\Users\mats\PhpstormProjects\Radix\vendor\infection\include-interceptor\src\IncludeInterceptor.p

[Killed] MethodCallRemoval
Services/HealthCheckService.php:41:17
                 $conn = $dbm->connection();
                 $conn->execute('SELECT 1');
                 $checks['db'] = 'ok';
-                $this->log('db=ok');
+                
             } else {
                 $checks['db'] = 'skipped';
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDatabaseCheckSuccess
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDatabaseCheckSuccess
Expected log message "db=ok" was not found. DB check might have failed or been skipped.
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:826

FAILURES!
Tests: 17, Assertions: 51, Failures: 1.

[Killed] DecrementInteger
Services/HealthCheckService.php:57:13
         try {
             // Använd dirname relativt till denna fil för att hitta roten.
             // Detta undviker beroende på global konstant och dödar mutanter relaterade till fallback-logik.
-            $root = dirname(__DIR__, 2);
+            $root = dirname(__DIR__, 1);
 
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
Expected created_dir log message was not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:879

FAILURES!
Tests: 18, Assertions: 53, Failures: 1.

[Killed] IncrementInteger
Services/HealthCheckService.php:57:13
         try {
             // Använd dirname relativt till denna fil för att hitta roten.
             // Detta undviker beroende på global konstant och dödar mutanter relaterade till fallback-logik.
-            $root = dirname(__DIR__, 2);
+            $root = dirname(__DIR__, 3);
 
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
Expected created_dir log message was not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:879

FAILURES!
Tests: 18, Assertions: 53, Failures: 1.

[Killed] ConcatOperandRemoval
Services/HealthCheckService.php:60:13
             $root = dirname(__DIR__, 2);
 
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
-            $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
+            $dir = DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
             if (!is_dir($dir)) {
                 @mkdir($dir, 0o755, true);
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
Expected created_dir log message was not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:879

FAILURES!
Tests: 18, Assertions: 53, Failures: 1.

[Killed] ConcatOperandRemoval
Services/HealthCheckService.php:60:13
             $root = dirname(__DIR__, 2);
 
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
-            $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
+            $dir = $root . DIRECTORY_SEPARATOR . 'cache' . 'health';
             if (!is_dir($dir)) {
                 @mkdir($dir, 0o755, true);
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
Expected created_dir log message was not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:879

FAILURES!
Tests: 18, Assertions: 53, Failures: 1.

[Killed] LogicalNot
Services/HealthCheckService.php:61:13
 
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
             $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
-            if (!is_dir($dir)) {
+            if (is_dir($dir)) {
                 @mkdir($dir, 0o755, true);
                 $this->log('created_dir {dir}', ['dir' => $dir]);
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Services/HealthCheckService.php:62:17
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
             $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
             if (!is_dir($dir)) {
-                @mkdir($dir, 0o755, true);
+                @mkdir($dir, 494, true);
                 $this->log('created_dir {dir}', ['dir' => $dir]);
             }
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceFailsIfProbeFileIsWrittenToWrongLocation
statusReason: PHPUnit 11.5.44 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.3
Configuration: C:\Users\mats\AppData\Local\Temp\infection\phpunitConfiguration.254c1bd3ae9833ba3d8d276f52769a62.infection.xml

..............W
Notice: fwrite(): Write of 1440 bytes failed with errno=13 Permission denied in C:\Users\mats\PhpstormProjects\Radix\vendor\infection\include-interceptor\src\IncludeIntercepto

[Killed] DecrementInteger
Services/HealthCheckService.php:62:17
             // Ta bort rtrim då ROOT_PATH/dirname förväntas vara utan trailing slash
             $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
             if (!is_dir($dir)) {
-                @mkdir($dir, 0o755, true);
+                @mkdir($dir, 492, true);
                 $this->log('created_dir {dir}', ['dir' => $dir]);
             }
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
mkdir permissions mismatch. Expected 0755, got 492
Failed asserting that 492 matches expected 493.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:889

FAILURES!
Tests: 18, Assertions: 55, Failures: 1.

[Killed] MethodCallRemoval
Services/HealthCheckService.php:63:17
             $dir = $root . DIRECTORY_SEPARATOR . 'cache' . DIRECTORY_SEPARATOR . 'health';
             if (!is_dir($dir)) {
                 @mkdir($dir, 0o755, true);
-                $this->log('created_dir {dir}', ['dir' => $dir]);
+                
             }
             $probe = $dir . DIRECTORY_SEPARATOR . 'probe.txt';
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsDirectoryCreation
Expected created_dir log message was not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:879

FAILURES!
Tests: 18, Assertions: 53, Failures: 1.

[Killed] ConcatOperandRemoval
Services/HealthCheckService.php:65:13
                 @mkdir($dir, 0o755, true);
                 $this->log('created_dir {dir}', ['dir' => $dir]);
             }
-            $probe = $dir . DIRECTORY_SEPARATOR . 'probe.txt';
+            $probe = DIRECTORY_SEPARATOR . 'probe.txt';
             if (@file_put_contents($probe, (string) time()) === false) {
                 throw new RuntimeException('file_put_contents failed');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Services/HealthCheckService.php:65:13
                 @mkdir($dir, 0o755, true);
                 $this->log('created_dir {dir}', ['dir' => $dir]);
             }
-            $probe = $dir . DIRECTORY_SEPARATOR . 'probe.txt';
+            $probe = $dir . 'probe.txt';
             if (@file_put_contents($probe, (string) time()) === false) {
                 throw new RuntimeException('file_put_contents failed');
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceFailsIfProbeFileIsWrittenToWrongLocation
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceFailsIfProbeFileIsWrittenToWrongLocation
Health check failed! Does the mutant path match our trap file?
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:757

FAILURES!
Tests: 15, Assertions: 47, Failures: 1.

[Killed] Identical
Services/HealthCheckService.php:66:13
                 $this->log('created_dir {dir}', ['dir' => $dir]);
             }
             $probe = $dir . DIRECTORY_SEPARATOR . 'probe.txt';
-            if (@file_put_contents($probe, (string) time()) === false) {
+            if (@file_put_contents($probe, (string) time()) !== false) {
                 throw new RuntimeException('file_put_contents failed');
             }
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Services/HealthCheckService.php:71:13
             }
             @unlink($probe);
             $checks['fs'] = 'ok';
-            $this->log('fs=ok dir={dir}', ['dir' => $dir]);
+            
         } catch (Throwable $e) {
             $ok = false;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsFileSystemCheckSuccess
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsFileSystemCheckSuccess
Expected fs=ok log message not found
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:733

FAILURES!
Tests: 14, Assertions: 45, Failures: 1.

[Killed] ArrayItemRemoval
Services/HealthCheckService.php:71:13
             }
             @unlink($probe);
             $checks['fs'] = 'ok';
-            $this->log('fs=ok dir={dir}', ['dir' => $dir]);
+            $this->log('fs=ok dir={dir}', []);
         } catch (Throwable $e) {
             $ok = false;
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsFileSystemCheckSuccess
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsFileSystemCheckSuccess
Expected "dir" key in context for fs=ok log
Failed asserting that false is true.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:734

FAILURES!
Tests: 14, Assertions: 46, Failures: 1.

[Killed] ArrayOneItem
Services/HealthCheckService.php:79:9
         }
 
         $checks['_ok'] = $ok;
-        return $checks;
+        return count($checks) > 1 ? array_slice($checks, 0, 1, true) : $checks;
     }
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthReturnsOkJsonAndHeaders
Failed asserting that 500 is identical to 200.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:180

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Services/HealthCheckService.php:87:9
      */
     private function log(string $msg, array $ctx = []): void
     {
-        $this->logger->info($msg, $ctx);
+        
     }
 
killedBy: Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
statusReason: 1) Radix\Tests\Api\HealthControllerTest::testHealthServiceLogsCheckExecution
Expected logs to be written
Failed asserting that an array is not empty.

C:\Users\mats\PhpstormProjects\Radix\tests\Api\HealthControllerTest.php:679

FAILURES!
Tests: 13, Assertions: 41, Failures: 1.
